{"puzzle_name": "Cozy Glamping", "num_pieces": 500, "box_dimensions": "12.1\" x 10\" x 2.7\"", "puzzle_dimensions": "0.1\" x 27.6\" x 19.7\"", "description": "No need to rough it when you can just picture yourself enjoying all the soothing luxuries within this “Cozy Glamping” jigsaw puzzle! Indulge in some “me-time” with this “Cozy Glamping” puzzle — you deserve it! Artist Steve Read creates a captivating scene you can easily imagine yourself stepping into. Strum a tune on the guitar, take a bite out of those sweet s’mores, or lower yourself into that steaming, muscle-relaxing bubble bath — the choice is yours! This 500-piece Large Format jigsaw puzzle combines easy-to-handle, clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! With pieces 20% larger than standard, this 500-piece Large Format jigsaw puzzle’s details are easy to see, so you can complete it in just a day or two. Crafted with an extra-thick backing and our linen-structured paper, the printed image is vibrant, crisp, and glare-free. About the Artist: The talented artist of our original “Cozy Retreat” puzzle, Steve Read is self-taught. Starting work as a mural designer, he became a freelance illustrator, working on high-profile advertising campaigns and licensing for 20 years. Steve has developed a very broad portfolio of amazing work, ranging from beautiful fairytale and fantasy illustrations to landscapes and gothic art. Steve lives in the UK, and his captivating images can be found on a wide range of products worldwide. Fun for ages 12 and up! Measures approximately 27 x 20 inches (70 x 50 cm) when completed. Made in Germany.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Cozy-Glamping-500-Pieces-Puzzle-12000825.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12000825_1.webp"], "price": [["22.99", "USD"]], "article_num": "12000825", "ean": "4005555008255", "barcode": "4005555008255", "brand": "Ravensburger", "tags": ["puzzles", "glamping", "outdoors", "relaxation"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/cozy-glamping-12000825", "age": "12+"}