{"puzzle_name": "CreArt Animals in Space - Paint by numbers for kids", "num_pieces": 0, "box_dimensions": "8.7\" x 6.3\" x 1.8\"", "puzzle_dimensions": "5 x 7 inches (13 x 18 cm)", "description": "Launch your child into an out-of-this world creative experience with our “Animals in Space” CreArt Painting by Numbers set! Let your child’s imagination soar like a shooting star with our “Animals in Space” CreArt paint-by-numbers kit! Fun and relaxing, the set comes complete with everything needed to make and display their very own masterpiece. Success is simple, with color-outlined sections and matching, odorless acrylic paints to ensure picture-perfect results. Finish in about 4 hours, let dry, then use the included frame to proudly display your budding artist’s talent! Looking for a fun activity that keeps your kids off their screens? Help them discover their inner artist with CreArt, our high-quality Painting by Numbers sets! With kid-friendly images designed to match abilities, each section is outlined in its paint color to ensure great results. Painting is a creative activity that may improve dexterity and concentration while providing a sense of satisfaction and relaxing calm. CreArt contains everything children need to create their painting: a high-quality, thick painting board; 10 water-based opaque acrylic paints in numbered pots; pallet to hold the easy-open/resealable paint pots steady; durable, fine-point paintbrush; easy-to-follow reference sheet; instructions; and a frame to display their finished artwork. Makes a great gift!", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/CreArt-Animals-in-Space-Paint-by-numbers-for-kids-age-years-up-25933.webp", "https://ravensburger.cloud/images/produktseiten/520x445/25933_1.webp"], "price": [["14.99", "USD"]], "article_num": "25933", "ean": "4005556259335", "barcode": "4005556259335", "brand": "Ravensburger", "tags": ["paint by numbers", "kids", "animals", "space"], "product_url": "https://www.ravensburger.us/en-US/products/art-crafts/paint-by-number-for-kids/animals-in-space-25933", "age": "7+"}