{"puzzle_name": "Animal Dreams", "num_pieces": 750, "box_dimensions": "10.4\" x 10.4\" x 2.2\"", "puzzle_dimensions": "19.7\" x 19.7\"", "description": "Don’t bother chasing your tail deciding how to relax — just grab our “Animal Dreams” puzzle and settle in for some stress-reducing puzzle fun! Join the jungle cats’ run and indulge in some soothing fun with our “Animal Dreams” jigsaw puzzle! Do you know who’s chasing whom in this scene as the four birds avoid getting caught up in the game? Rich colors and fanciful details make this whimsical illustration a winner. Solve this 750-piece puzzle and let your dream of carefree enjoyment become a reality as you feel the stress from your demanding day dissolve — you deserve it! Take a mindful moment to refresh your inner-self and restore balance with an intriguing image from our Art & Soul series! With themes from nature to out-of-this-world fun, each 750-piece jigsaw puzzle combines a captivating illustration with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience. Made from 70% or more recycled materials, our puzzles are crafted with an exclusive, extra-thick backing topped with superior, linen-structured paper for a vibrant, crisp, and glare-free image. Create memorable moments with Ravensburger premium puzzles! Fun for ages 12 and up! Measures approximately 20 x 20 inches (50 x 50 cm) when completed. Made in Germany.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Animal-Dreams-750-Pieces-Puzzle-12001001.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001001_1.webp"], "price": [["14.99", "USD"], ["19.99", "USD"]], "article_num": "12001001", "ean": "4005555010012", "barcode": "4005555010012", "brand": "Ravensburger", "tags": ["animals", "jigsaw puzzles", "relaxation", "art", "nature"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/animal-dreams-12001001", "age": "14+"}