{"puzzle_name": "Colorful Fox", "num_pieces": 150, "box_dimensions": "6.3\" x 8.7\" x 1.8\"", "puzzle_dimensions": "8 x 10.25 inches (20 x 26 cm)", "description": "Watch out — this sly red “Fox” Shaped Wooden puzzle, bedecked in beautiful blooms, may just sneak into your heart! Spend time relaxing with nature! Our 150-piece “Fox” Shaped Wooden puzzle is hand designed with smooth, laser cut edges for hours of puzzle fun. The colorful illustration is printed directly on the wood for a vibrant puzzling experience. Inspired by the image, 15 delightful whimsy pieces are incorporated within! Made of eco-friendly engineered wood and packed in a biodegradable paper bag, this sturdy puzzle makes a thoughtful, sustainable gift for your favorite nature lover or environmentalist! Made by expert designers, 15 of our wooden jigsaw pieces come in unique and delightful shapes like a butterfly, bird, foxes and more! The interlocking pieces feel smooth to the touch and are made of premium wood with a natural, outdoorsy scent. The image is printed directly on the wooden material (not on paper) so there’s no chance of it peeling or colors fading over time. The sturdy pieces are just over 1/8 inch (4mm) thick to ensure lots of long-lasting fun as you make this delightful puzzle over and over again! From fun family times to long-term health benefits like stress-reducing, mindful moments, there are so many positives about puzzles! Makes a thoughtful birthday, Christmas, or holiday gift. Create memorable moments with Ravensburger premium puzzles today!", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Ravensburger-Colorful-Fox-17512.webp", "https://ravensburger.cloud/images/produktseiten/520x445/17512_1.webp", "https://ravensburger.cloud/images/produktseiten/520x445/17512_2.webp", "https://ravensburger.cloud/images/produktseiten/520x445/17512_3.webp", "https://ravensburger.cloud/images/produktseiten/520x445/17512_5.webp", "https://ravensburger.cloud/images/produktseiten/520x445/17512_6.webp", "https://ravensburger.cloud/images/produktseiten/520x445/17512_7__en_GB-en_US.webp"], "price": [["29.99", "USD"]], "article_num": "17512", "ean": "4005556175123", "barcode": "4005556175123", "brand": "Ravensburger", "tags": ["wooden puzzles", "animals", "nature", "fantasy", "eco-friendly"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/wooden-puzzles/colorful-fox-17512", "age": "10+"}