{"puzzle_name": "Batman Collector’s Edition", "num_pieces": 1000, "box_dimensions": "13.2\" x 10\" x 2.2\"", "puzzle_dimensions": "0.1\" x 27.6\" x 19.7\"", "description": "Can the Caped Crusader defeat his fiercest foes in our “Batman Collector’s Edition” puzzle? Harley Quinn is up to her usual tricks and infiltrated the Batcave, releasing a noxious gas that’s causing Batman to hallucinate — or is he? As his mortal enemies seem to break free of their monitors, the Dark Knight must fight to gain control and restore the safety and sanctity of his lair! But will the sinister forces of Mr. Freeze, Two-Face, Penguin, Bane, Joker, Poison Ivy and Scarecrow be more than he can withstand? You decide as you puzzle together this imagined scene from the DC universe! Part of our Collector’s Edition puzzle series — a fun and immersive puzzling experience for any fan of the Batman comics, TV series or movies! This 1,000-piece jigsaw puzzle combines captivating imagery with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience. Our puzzles are crafted with an exclusive, extra-thick cardboard backing along with our superior, linen-structured paper, so the printed image is vibrant, crisp, and glare-free. Create memorable moments with Ravensburger premium puzzles! Fun for ages 14 and up! Measures approximately 70 x 50 cm (27 x 19.5 inches) when completed.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Batman-Collectors-Edition-1000-Pieces-Puzzle-12000244.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12000244_1.webp"], "price": [["29.99", "USD"]], "article_num": "12000244", "ean": "4005555002444", "barcode": "4005555002444", "brand": "Ravensburger", "tags": ["fantasy", "adventure", "superheroes", "Batman"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/batman-collector-s-edition-12000244", "age": "14+"}