{"puzzle_name": "Cats of Mykonos", "num_pieces": 1500, "box_dimensions": "13.2\" x 10\" x 2.2\"", "puzzle_dimensions": "0.1\" x 31.5\" x 23.6\"", "description": "Bask in the glorious sunshine on this gorgeous Greek isle amid a bevy of furry felines in our “Cats of Mykonos” jigsaw puzzle by artist Steve Read! Journey to the Cyclades Islands off the coast of Greece and find a piece of paradise in our “Cats of Mykonos” puzzle by artist Steve Read! One of the unique charms of Mykonos is its vast population of stray cats. With about 10,000 residents and about 50,000 felines, imagine exploring winding alleys with sleeping cats strewn about! The resourceful felines frequent the harbor where local fishermen share fresh cast-offs from their latest catch. Makes a great gift for the cat lover in your life! This 1,500-piece jigsaw puzzle combines captivating imagery with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Made from 70% or more recycled materials, our puzzles are crafted with an exclusive, extra-thick backing along with our superior, linen-structured paper, so the printed image is vibrant, crisp, and glare-free. Create memorable moments with Ravensburger premium puzzles! About the Artist: The originator of our “Cozy Retreat” puzzle, Steve Read is a talented, self-taught artist. First a mural designer, he became a freelance illustrator, working on high-profile ad campaigns and licensing for 20 years. Steve’s broad portfolio of amazing work ranges from beautiful fantasy illustrations to landscapes and gothic art. Steve lives in the UK and his captivating images can be found on products worldwide. Fun for ages 14 and up! Measures approximately 31.5 x 23.5 inches (80 x 60 cm) when completed. Made in Germany.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Cats-of-Mykonos-1500-Pieces-Puzzle-12001450.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001450_1.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001450_2.webp"], "price": [["33.99", "USD"]], "article_num": "12001450", "ean": "4005555014508", "barcode": "4005555014508", "brand": "Ravensburger", "tags": ["cats", "Mykonos", "Greece", "puzzle", "jigsaw"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/cats-of-mykonos-12001450", "age": "14+"}