{"puzzle_name": "Big Animal World", "num_pieces": 2000, "box_dimensions": "17.1\" x 11.9\" x 2.2\"", "puzzle_dimensions": "0.1\" x 38.6\" x 29.5\"", "description": "Discover animals from every continent roaming among the tomes in our wonderful “Big Animal World” puzzle by artist Aimee Stewart! Since 1891 we've been making the finest puzzles in Ravensburg, Germany. It's our attention to detail which makes Ravensburger the world's greatest puzzle brand. We use an exclusively developed, extra-thick cardboard and combine this with our fine, linen-structured paper to create a glare-free puzzle image for a quality you can feel. Our steel cutting tools are designed and crafted by hand. This ensures that no two pieces are alike and guarantees a perfect interlocking fit.For beginners who feel comfortable with a small number of pieces, for advanced puzzlers who prefer a medium challenge, and of course for absolute professionals who don't shy away from 40,320 pieces. With the enormous variety of motifs in the Ravensburger puzzle range, nothing stands in the way of an unforgettable puzzle experience. The uniqueness of the characteristic puzzle pieces is achieved by handcrafted cutting tools, which are manufactured with extreme precision in Ravensburg, Upper Swabia. Decades of experience in puzzle production and high quality standards for materials, motifs, and design make puzzlers' hearts beat faster as they experience how one piece fits into another. That is Ravensburger's passion for quality.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Big-Animal-World-2000-Pieces-Puzzle-16652.webp", "https://ravensburger.cloud/images/produktseiten/520x445/16652_1.webp"], "price": [["39.99", "USD"]], "article_num": "16652", "ean": "4005556166527", "barcode": "4005556166527", "brand": "Ravensburger", "tags": ["animals", "nature"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/big-animal-world-16652", "age": "14+"}