{"puzzle_name": "Ravensburger Choose Happy", "num_pieces": 0, "box_dimensions": "8.7\" x 8.7\" x 1.9\"", "puzzle_dimensions": "0.1\" x 7.9\" x 7.9\"", "description": "Zip along and enjoy hours of restoring, mindful moments when you “Choose Happy” with our CreArt Painting by Numbers set! Paint this peppy moped carrying a beautiful bouquet of blooms with our CreArt paint-by-number kit and create a gentle reminder to “Choose Happy”! Treat yourself to some “me time”, with everything you need included. Simply fill in each clearly numbered section and watch the image emerge! The prepared patterns and high-quality, odorless acrylic paints ensure excellent results as you create your personal masterpiece. De-stress and find success as you discover the joy of art in your heart today! Enjoy the relaxing and rewarding experience of creating art without the pressure of facing a blank canvas! The prepared patterns in this Painting by Numbers set lets you create a personal masterpiece you’ll be proud to display. A meditative activity, painting can help relieve the stress of the day while providing a satisfying sense of accomplishment! With the same dependable quality you’ve come to know in our puzzles and games, this premium paint-by-number kit comes with everything you need: a durable, smooth white painting board with clearly numbered sections; easy-open/close water-based, odorless acrylic paints in matching numbered pots; finishing gloss; dual-tipped, wood-handle paintbrush with fine points (#1, #2) for precise details; artist pallet to keep paint pots steady; and easy-to-follow guide sheet. Frame not included. Made in Czech Republic.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Ravensburger-Choose-Happy-20125.webp", "https://ravensburger.cloud/images/produktseiten/520x445/20125_1.webp"], "price": [["11.04", "USD"], ["16.99", "USD"]], "article_num": "20125", "ean": "4005556201259", "barcode": "4005556201259", "brand": "Ravensburger", "tags": ["arts and crafts", "painting by numbers", "mindfulness"], "product_url": "https://www.ravensburger.us/en-US/products/sale/sale-arts-crafts/choose-happy-20125", "age": "12+"}