{"puzzle_name": "Canada Jigsaw Nationals: A Walk in the Rain", "num_pieces": 500, "box_dimensions": "11.6\" x 9.1\" x 1.5\"", "puzzle_dimensions": "19.5 x 14.25 inches (49 x 36 cm)", "description": "Take “A Walk in the Rain” and rediscover the simple joys in life, like completing a fun, relaxing jigsaw puzzle! Tune out your troubles and return to the innocence of childhood with our “A Walk in the Rain” 500-piece puzzle by artist Katerina Mertikas! Katerina explains that she does not seek to change the world through her art but, rather, to help the viewer turn to the simpler things in life that warm the heart and soothe the soul. This charming scene was completed in the speed-puzzling Individual Division Final Round at the 2025 Canadian National Jigsaw Puzzle Competition! This 500-piece jigsaw puzzle combines captivating imagery with Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Our puzzles are crafted with an exclusive, extra-thick backing and a superior, linen-structured paper so the printed image is vibrant and glare-free. Create memorable moments with Ravensburger premium puzzles! About the Artist: Born in Greece, Katerina Mertikas is a self-taught artist who lived much of her life in Ottawa, Canada. She loves creating classic Canadian landscapes and painting popular outdoor pastimes. Always inspired by her two daughters and five grandchildren, Katerina classifies her style as naïve expressionism and focuses on conveying messages of love, peace, innocence, and friendship. Fun for ages 12 and up! Measures approximately 19.5 x 14.25 inches (49 x 36 cm) when completed. Made in Germany.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Canada-Jigsaw-Nationals-A-Walk-in-the-Rain-500-Pieces-Puzzle-12001637.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001637_1.webp"], "price": [["17.99", "USD"]], "article_num": "12001637", "ean": "4005555016373", "barcode": "4005555016373", "brand": "Ravensburger", "tags": ["jigsaw puzzle", "Canada", "rain", "Katerina Mertikas"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/canada-jigsaw-nationals-a-walk-in-the-rain-12001637", "age": "12+"}