{"puzzle_name": "Canada Jigsaw Nationals: Puzzle Passion", "num_pieces": 1000, "box_dimensions": "13.2\" x 10\" x 2.2\"", "puzzle_dimensions": "0.1\" x 27.6\" x 19.7\"", "description": "Dedicate yourself to hours of delightful, soothing satisfaction as you place each piece in our playful “Puzzle Passion” jigsaw puzzle! Delight in the details in our “Puzzle Passion” puzzle! Artist Patrick Boyer uses a stylized version of Botticelli’s The Birth of Venus in his illustration. Can you find Zephyrus (Greek god of the west wind), and Aura (goddess of the breeze) from the same famous work? Surrounding them are animals, flowers, fruit, and more, including puzzle pieces! This immersive illustration was completed in the Teams Division Final Round at the 2025 Canadian Jigsaw Nationals speed-puzzling competition! This 1,000-piece jigsaw puzzle combines captivating imagery with Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Our puzzles are crafted with an exclusive, extra-thick backing and a superior, linen-structured paper so the printed image is vibrant and glare-free. Create memorable moments with Ravensburger premium puzzles! About the Artist: Patrick Boyer has a unique talent for visual storytelling. A highly regarded artist with over 25 years of experience in montage illustrations for media, entertainment, and advertising, Patrick’s skillfully crafted compositions reflect his contemporary style. Residing in Vancouver, BC, he finds balance by drawing inspiration from nature for his health and well-being. Fun for ages 14 and up! Measures approximately 27 x 20 inches (70 x 50 cm) when completed. Made in Germany.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Canada-Jigsaw-Nationals-Puzzle-Passion-1000-Pieces-Puzzle-12001642.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001642_1.webp"], "price": [["24.99", "USD"]], "article_num": "12001642", "ean": "4005555016427", "barcode": "4005555016427", "brand": "Ravensburger", "tags": ["puzzle", "jigsaw", "Canada", "art", "Botticelli"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/canada-jigsaw-nationals-puzzle-passion-12001642", "age": "14+"}