{"puzzle_name": "Beautiful Sea Unicorn & Friends", "num_pieces": 1500, "box_dimensions": "13.2\" x 10\" x 2.2\"", "puzzle_dimensions": "0.1\" x 31.5\" x 23.6\"", "description": "Welcome to a world of wonder where vibrant, magical creatures gather for frolicking fun in this fantastical “Sea Unicorn” jigsaw puzzle! Enjoy a treasure trove of factual and fantasy creatures in this “Sea Unicorn” 1500-piece puzzle for hours of relaxing fun! Along with sea unicorns and alicorns (flying unicorns), there are tropical dragons, fairies and more. The mangrove-inspired trees provide a safe haven for birds, butterflies and an assortment of animals. Artist Rose Khan has also included her signature characters; can you find the keys and three ‘kitties’? Enjoy some me-time with this beautifully illustrated puzzle today! This 1,500-piece jigsaw puzzle combines captivating imagery with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Our puzzles are crafted with an exclusive, extra-thick cardboard backing along with our superior, linen-structured paper, so the printed image is vibrant, crisp, and glare-free. About the Artist: Rose Catherine Khan is a master of fantasy, delighting the eye with her lavish illustrations. She particularly enjoys illustrating intricate puzzles and designing figurines. Her collectibles can be found in retail stores across the world, and her spellbinding prose transports readers to the world of Centernia through her novel series. When not illustrating and writing, Rose now enjoys living in Florida. Fun for ages 14 and up! Measures approximately 31.5 x 23.5 inches (80 x 60 cm) when completed. Made in Germany.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Beautiful-Sea-Unicorn-Friends-1500-Pieces-Puzzle-12000798.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12000798_1.webp"], "price": [["33.99", "USD"]], "article_num": "12000798", "ean": "4005555007982", "barcode": "4005555007982", "brand": "Ravensburger", "tags": ["fantasy", "adventure", "unicorns", "puzzles for adults"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/beautiful-sea-unicorn-friends-12000798", "age": "14+"}