{"puzzle_name": "Abandoned Places: Tattered Toy Store", "num_pieces": 1000, "box_dimensions": "13.2\" x 10\" x 2.2\"", "puzzle_dimensions": "27.6\" x 19.7\"", "description": "Want to play? Piece together our “Tattered Toy Store” puzzle and find your favorite toys from 40 years ago — for sure! How sad, and kind of creepy, to see these abandoned toys filling the shelves and spilling out on the floor in this once beloved toy store! Classic toys of days gone by include forlorn teddy bears, forgotten fashion dolls, and that fun robot boxing game. And how would you like a coin for the gumball machine with decades-old gum inside? Talk about a jaw breaker! Part of our Abandoned Series, this “Tattered Toy Store” scene will be a fun one to puzzle for any fan or child of the ‘70s and ‘80s! This 1,000-piece jigsaw puzzle combines captivating imagery with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Our puzzles are crafted with an exclusive, extra-thick backing along with our superior, linen-structured paper, so the printed image is vibrant, crisp, and glare-free. Create memorable moments with Ravensburger premium puzzles! About the Artist: Eduard studied Graphic Design at the Kharkiv Academy of Arts in Ukraine. He moved from the city of Donetsk in 2014 and now lives in Poltava. Drawing inspiration from his favorite artist Albrecht Dürer, Eduard produced artwork for numerous magazines. He later transitioned to computer game design and then joined Artbeat Studio, a collective of talented and successful artists. Fun for ages 14 and up! Measures approximately 27 x 19.5 inches (70 x 50 cm) when completed.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Abandoned-Places-Tattered-Toy-Store-1000-Pieces-Puzzle-12000636.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12000636_1.webp"], "price": [["18.74", "USD"], ["24.99", "USD"]], "article_num": "12000636", "ean": "4005555006367", "barcode": "4005555006367", "brand": "Ravensburger", "tags": ["Fantasy & Adventure", "Gothic", "Horror"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/abandoned-places-tattered-toy-store-12000636", "age": "14+"}