{"puzzle_name": "Cherish Your World with Dulk: Archipelago", "num_pieces": 500, "box_dimensions": "8.7\" x 8.7\" x 2.7\"", "puzzle_dimensions": "0.1\" x 18.5\" x 18.5\"", "description": "Find refuge in this thought-provoking “Archipelago” jigsaw puzzle by the artist Dulk, illustrating the importance of a healthy ocean ecosystem! Our “Archipelago” puzzle highlights the plight of some of the ocean’s most unique creatures! An incredibly rare albino humpback whale is being transformed into part of the archipelago, creating a place of refuge for all the birds and marine species. The souls of lost animals fly in the sky. Part of our “Cherish Your World” series, the artist Dulk includes small targets in his surreal works to emphasize the fragility of, and threat to, nature with hope of inspiring us to protect our planet! This 500-piece jigsaw puzzle combines captivating imagery with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Made from 70% or more recycled materials, our puzzles are crafted with an exclusive, extra-thick cardboard backing topped by our superior, linen-structured paper, so the printed image is vibrant, crisp, and glare-free. Create memorable moments with Ravensburger premium puzzles! About the Artist: Inspired by nature, Spanish artist Dulk (aka Antonio Segura Donat) mixes reality with his surrealist world as part of his creative process. He shares, “My goal of converting nature into artwork is to create awareness and interest to change people’s behavior about climate change and protection of our ecosystems. If my artwork inspires even one person to take positive actions towards protecting our earth, everything I do is worth it.” Fun for ages 12 and up! Measures approximately 18 x 18 inches (46 x 46 cm) when completed. Made in Germany.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Cherish-Your-World-with-Dulk-Archipelago-500-Pieces-Puzzle-12001472.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001472_1.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001472_2.webp"], "price": [["17.99", "USD"]], "article_num": "12001472", "ean": "4005555014720", "barcode": "4005555014720", "brand": "Ravensburger", "tags": ["ocean", "ecosystem", "surrealism", "Dulk", "art"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/cherish-your-world-with-dulk-archipelago-12001472", "age": "12+"}