{"puzzle_name": "Colors on Colors", "num_pieces": 1000, "box_dimensions": "13.2\" x 10\" x 2.2\"", "puzzle_dimensions": "0.1\" x 27.6\" x 19.7\"", "description": "Splash into a soothing rainbow waterfall of calm in this “Colors on Colors” 1000-piece puzzle by that nerdy YouTube host you love — Karen Puzzles! YouTube host Karen Puzzles has been doing jigsaw puzzles for as long as she can remember! Since starting her channel in 2008, she’s posted tons of fun videos and now runs Karen Puzzles full-time. A self-proclaimed nerd, Karen is happy to share her favorite hobby with puzzlers all over the world, saying, “I'm so thrilled to have an audience that wants to support me in sharing this passion with all of you!” And we’re thrilled to bring you her very own “Colors on Colors” puzzle design to enjoy! Part of our Karen Puzzles Collection series, this image uses photographed gradient puzzle pieces from The Play Group’s 5000-piece gradient puzzle, designed by acclaimed artist Clemens Habicht, with each piece subtly different from the next. Karen also included pieces of her Gradient Cascade puzzle by Ravensburger in this engaging composition reminiscent of a rainbow waterfall. She says, “I love puzzles that are colorful, because I always say that if I’m going to be staring at something for hours on end, I want it to be colors that make me happy!” This 1,000-piece jigsaw puzzle features clean-cut pieces and our perfect interlocking fit for a most pleasurable puzzling experience. Our puzzles are crafted with an extra-thick backing and our superior, linen-structured paper, so the printed image is vibrant, crisp, and glare-free. Measures approximately 27 x 20 inches (70 x 50 cm) when completed. Made in Germany.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Colors-on-Colors-1000-Pieces-Puzzle-12001027.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001027_1.webp"], "price": [["24.99", "USD"]], "article_num": "12001027", "ean": "4005555010272", "barcode": "4005555010272", "brand": "Ravensburger", "tags": ["design", "art", "creativity", "puzzles", "Karen Puzzles"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/colors-on-colors-12001027", "age": "14+"}