{"puzzle_name": "Bavaria Romance", "num_pieces": 500, "box_dimensions": "11.6\" x 9.1\" x 1.5\"", "puzzle_dimensions": "0.1\" x 19.3\" x 14.2\"", "description": "Immerse yourself in the charm of Bavaria with this captivating 500-piece puzzle, showcasing a picturesque scene straight out of a fairy tale. As you piece together this delightful puzzle, you'll find yourself strolling down a quaint brick street adorned with colorful buildings illuminated by soft, inviting light, with tables and chairs set outside charming cafes, inviting you to imagine yourself savoring a leisurely meal al fresco. Friendly dogs wander the streets, adding to the idyllic atmosphere. Our 500pc piece jigsaws are crafted with premium quality materials and measure 49 x 36cm when complete. Great for Adults and ideal puzzles for Children 10 years old and up. Fully complies with all necessary UK and EU testing standards. Bestselling puzzle brand worldwide - With over 1 billion puzzles sold, our jigsaw puzzles make ideal gifts for women, great gifts for men and fit perfectly on our puzzle board. Our puzzles use an exclusive, extra-thick cardboard combined with our fine, linen structured paper to create a glare-free puzzle image and give you the best experience possible. #Positivelypuzzling - From fun family times together to long term health benefits and day-to-day mindful moments, there are so many positives about the humble Jigsaw! They make a great birthday gift or smashing Christmas gift.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Bavaria-Romance-500-Pieces-Puzzle-12001381.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001381_1.webp"], "price": [["17.99", "USD"]], "article_num": "12001381", "ean": "4005555013815", "barcode": "4005555013815", "brand": "Ravensburger", "tags": ["Bavaria", "romance", "jigsaw puzzle", "500 pieces", "adults"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/bavaria-romance-12001381", "age": "12+"}