{"puzzle_name": "Canadian Collection: Fisherman's Cove", "num_pieces": 1000, "box_dimensions": "13.2\" x 10\" x 2.2\"", "puzzle_dimensions": "0.1\" x 27.6\" x 19.7\"", "description": "Capture a quintessential Canadian scene as you savor some stress-reducing down time piecing together our “Fisherman’s Cove” puzzle! Escape the burdens of the day and spend some quality time in the quiet comfort of “Fisherman’s Cove”! With a brilliant backdrop of vibrant homes and businesses, some of the townsfolk are busy repairing nets and processing today’s catch. An extensive collection of buoys decorates the boathouse, while the boat “Étoile” (“Star”) is ready for its next voyage. Full of details that are sure to delight, solving this puzzle is a wonderful way to while away the hours when you can’t be out on the water! This 1,000-piece jigsaw puzzle combines captivating imagery with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Our puzzles are crafted with an extra-thick backing along with our superior, linen-structured paper, so the printed image is vibrant, crisp, and glare-free. Create memorable moments with Ravensburger premium puzzles! About the Artist: Wilfrido Limvalencia is a self-taught artist who loves painting scenes that evoke delight and joy. His 'folk-realism' style is infused with innocent charm embellished with realistic details. Wilfrido is based in British Columbia, Canada, but most of his work is published in the United States, Japan, and other countries, with several licensed for jigsaw puzzles, greeting cards, calendars, and more. Fun for ages 14 and up! Measures approximately 27 x 20 inches (70 x 50 cm) when completed.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Canadian-Collection-Fishermans-Cove-1000-Pieces-Puzzle-12000306.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12000306_1.webp"], "price": [["24.99", "USD"]], "article_num": "12000306", "ean": "4005555003069", "barcode": "4005555003069", "brand": "Ravensburger", "tags": ["jigsaw puzzle", "Canadian collection", "Fisherman's Cove", "art", "puzzles for adults"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/canadian-collection-fisherman-s-cove-12000306", "age": "14 - 99"}