{"puzzle_name": "CreArt Best Friends - Paint by numbers for kids", "num_pieces": 0, "box_dimensions": "7.9\" x 10.4\" x 1.8\"", "puzzle_dimensions": "0.1\" x 7.1\" x 9.4\"", "description": "Encourage kids to ditch their screens and be creative with a beautiful butterfly and curious kitten in our “Best Friends” CreArt Painting by Numbers! Watch your child discover their inner artist as they create a vibrant scene with this “Best Friends” CreArt paint-by-numbers kit! They can relax with this fun, satisfying activity, complete with everything needed to make and display their very own masterpiece. Success is simple, with color-outlined sections and matching, odorless acrylic paints to ensure picture-perfect results. Finish in about 4 hours, let dry, then use the included frame to proudly display your budding artist’s talent! Looking for a fun activity that keeps your kids off their screens? Help them discover their inner artist with CreArt, our high-quality Painting by Numbers sets! With kid-friendly images designed to match abilities, budding artists can enjoy completing their very own painting in just a few hours. Easy-to-see colored outlines distinguish each section, helping kids achieve great results. Painting is a fun, creative activity that can also improve dexterity and concentration while providing a sense of satisfaction! CreArt contains everything children need to create their painting: a high-quality, thick painting board; 15 water-based, opaque acrylic paints in numbered pots; pallet to hold the easy-open/resealable paint pots steady; durable, fine-point paintbrush; easy-to-follow guide sheet; and frame to display their finished artwork. Makes a great gift!", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/CreArt-Best-Friends-Paint-by-numbers-for-kids-9-years-up-28935.webp", "https://ravensburger.cloud/images/produktseiten/520x445/28935_1.webp"], "price": [["19.99", "USD"]], "article_num": "28935", "ean": "4005556289356", "barcode": "4005556289356", "brand": "Ravensburger", "tags": ["paint by numbers", "kids", "art", "creativity"], "product_url": "https://www.ravensburger.us/en-US/products/art-crafts/paint-by-number-for-kids/best-friends-28935", "age": "9 - 99"}