{"puzzle_name": "CreArt By the River F/EN - Paint by numbers for adults", "num_pieces": null, "box_dimensions": "14.3\" x 10.4\" x 1.8\"", "puzzle_dimensions": "1.8\" x 14.3\" x 10.4\"", "description": "Soothe your mind, body, and soul with a creative break as you relax “By the River” with our CreArt Painting by Numbers set! Enjoy some mindful moments sitting “By the River” with this CreArt paint-by-number kit! Rest your mind and go to your peaceful place with no screens and no demands as you fill in each clearly numbered section, bit by bit. High-quality, odorless acrylic paints ensure excellent results. When finished, hang it as a gentle reminder to take time for some well-deserved self-care! De-stress and find success as you discover the joy of art in your heart today! Enjoy the relaxing and rewarding experience of creating art without the pressure of facing a blank canvas! The prepared patterns in this Painting by Numbers set lets you create a personal masterpiece you’ll be proud to display. A meditative activity, painting can help relieve the stress of the day while providing a satisfying sense of accomplishment! With the same dependable quality you’ve come to know in our puzzles and games, this premium paint-by-number kit comes with everything you need: a durable, smooth white painting board with clearly numbered sections; 18 easy-open/close water-based, odorless acrylic paints in matching numbered pots; finishing gloss; 2 wood-handle paintbrushes with fine points (#1, #2) for precise details; artist pallet to keep paint pots steady; picture hanger and easy-to-follow guide sheet. Frame not included.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/CreArt-By-the-River-FEN-Paint-by-numbers-for-adults-25980.webp", "https://ravensburger.cloud/images/produktseiten/520x445/25980_1.webp"], "price": [["24.99", "USD"]], "article_num": "25980", "ean": "4005556259809", "barcode": "4005556259809", "brand": "Ravensburger", "tags": ["paint by numbers", "art", "relaxation", "self-care"], "product_url": "https://www.ravensburger.us/en-US/products/art-crafts/paint-by-number-for-adults/by-the-river-f-en-25980", "age": null}