{"puzzle_name": "Canada Jigsaw Nationals: Toronto", "num_pieces": 1000, "box_dimensions": "13.2\" x 10\" x 2.2\"", "puzzle_dimensions": "0.1\" x 27.6\" x 19.7\"", "description": "Visit iconic sights found in the city that’s home to over six million folks living in the 6ix in our “Toronto” 1000-piece puzzle! Hop on the TTC and take a ride around this diverse city and it’s six local boroughs in our “Toronto” jigsaw puzzle for hours of relaxing fun! Artist Miguel Freitas captures iconic city sights with a twist. Visit Ontario Place, the Rogers Centre, the Flatiron Building, and ride to the top of the CN Tower soaring high above the city. This whimsical and surreal work of art was completed in the speed-puzzling Pairs Division Final at the 2025 Canadian National Jigsaw Puzzle Competition! Beauty, eh?This 1,000-piece jigsaw puzzle combines captivating imagery with our exclusive, extra-thick cardboard backing, clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Create memorable moments with Ravensburger premium puzzles! About the Artist: Born in Portugal and a Canadian native, Miguel Freitas has been painting professionally since 2004. His unique painting style combines a distorted perspective with a slight touch of whimsy. That, along with the thickness of multiple layers of sculpted paint, creates a highly textured surface that makes his art unique and recognizable. His works are collected worldwide and are represented by prominent galleries throughout North America. Fun for ages 14 and up! Measures approximately 27 x 20 inches (70 x 50 cm) when completed.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Canada-Jigsaw-Nationals-Toronto-1000-Pieces-Puzzle-12001640.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001640_1.webp"], "price": [["24.99", "USD"]], "article_num": "12001640", "ean": "4005555016403", "barcode": "4005555016403", "brand": "Ravensburger", "tags": ["Toronto", "Canada", "jigsaw puzzle", "puzzles for adults"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/canada-jigsaw-nationals-toronto-12001640", "age": "14+"}