{"puzzle_name": "Children’s Jigsaw Puzzle Bauernhof und Baustelle", "num_pieces": 24, "box_dimensions": "10.8\" x 7.6\" x 1.5\"", "puzzle_dimensions": "0.1\" x 10.2\" x 7.1\"", "description": "Whether it’s a horse or a kitten, a digger or a fire engine – the colourful images of the Ravensburger 2x12-piece and 2x24-piece puzzle sets will delight girls and boys ages 3 and 4 and up! Because two children’s puzzles provide twice the puzzle fun. Including mini-posters of the completed images. Our puzzles are produced in excellent quality craftsmanship with material from sustainable forestry. They are educationally valuable and offer plenty of learning enjoyment.Find pieces, join them together and enjoy the steadily growing image – doing jigsaw puzzles means one little success story after the next. That’s why children love to join together puzzle pieces from their favourite images again and again. But puzzles offer more than fun: if the correct level of difficulty is selected, children of any age can grow with the challenges, increase their patience and strengthen their self-confidence. In the large selection of Ravensburger children’s puzzles with the most popular images, from 2 pieces to 300 pieces, there is guaranteed to be the right one for every child. Selecting the images and the high quality of our children’s puzzles are extremely important to us. Therefore, the safety of all materials is confirmed by an independent institute. For more than 100 years, we have been developing puzzles that children love: with age-appropriate images, complexity and size.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Childrens-Jigsaw-Puzzle-Bauernhof-und-Baustelle-24-Pieces-Puzzle-80560.webp", "https://ravensburger.cloud/images/produktseiten/520x445/80560_1.webp"], "price": [["14.99", "USD"]], "article_num": "80560", "ean": "4005556805600", "barcode": "4005556805600", "brand": "Ravensburger", "tags": ["Engineering", "Everyday Life", "Work", "Animals", "Nature", "Construction Site", "Farming", "Vehicles"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-kids/bauernhof-und-baustelle-80560", "age": "4+"}