{"puzzle_name": "Canyon Camping", "num_pieces": 1500, "box_dimensions": "13.2\" x 10\" x 2.2\"", "puzzle_dimensions": "0.1\" x 31.5\" x 23.6\"", "description": "Paddle your way to hours of stress-reducing peace and quiet with this “Canyon Camping” jigsaw puzzle! The sun will soon be setting on another glorious day of exploring and “Canyon Camping”! Artist Jason Taylor sets the scene for a good night’s sleep, with a comfy air mattress, cozy sleeping bags, and two camp chairs to witness a spectacular sunset. Looks like you’ll have plenty of company, with a ringtail checking out your canoe, a prairie dog sniffing your food, and a coyote looking very comfortable in your camp. What a fabulous place to escape all the pressures of the day! This 1,500-piece jigsaw puzzle combines captivating imagery with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Our puzzles are crafted with an exclusive, extra-thick cardboard backing along with our superior, linen-structured paper, so the printed image is vibrant, crisp, and glare-free. About the Artist: Jason Taylor lives in Topanga Canyon, California, just a short drive from the Pacific Ocean he loves. He has spent the past few years shifting from traditional to digital art. Jason has embraced hitting the road part of the year in his van to get a close-up view of the vast variety of American life. Car, surf, nature and farm culture spark his imagination as he continues his goal of visiting all 50 of the United States. Measures approximately 31.5 x 23.5 inches (80 x 60 cm) when completed. Made in Germany.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Canyon-Camping-1500-Pieces-Puzzle-12001007.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001007_1.webp"], "price": [["33.99", "USD"]], "article_num": "12001007", "ean": "4005555010074", "barcode": "4005555010074", "brand": "Ravensburger", "tags": ["animals", "nature", "camping", "landscapes"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/canyon-camping-12001007", "age": "14+"}