{"puzzle_name": "Baby Love", "num_pieces": 500, "box_dimensions": "12.1\" x 10\" x 2.7\"", "puzzle_dimensions": "27.6\" x 19.7\"", "description": "Tame your wild ones with some quality family time as you celebrate the bonds that tie us together in this blissful “Baby Love” jigsaw puzzle! Gather the family to work on this lovely “Baby Love” puzzle and share that amazing sense of satisfaction as each piece clicks into place! The watering hole is popular today, with mamas, papas and their young ones taking a break to quench their thirst and get some rest under the hot African sun. Everyone is a friend here — giraffes, zebras, elephants, lions, meerkats, vervet monkeys and birds can all relax without fear. Enjoy some peaceful puzzle time and mindful moments with your tribe today! This 500-piece Large Format jigsaw puzzle combines easy-to-handle, clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! With pieces 20% larger than standard, details are easy to see, so you can complete it in just a day or two. Crafted with an extra-thick backing and our linen-structured paper, the printed image is vibrant, crisp, and glare-free. Create memorable moments with Ravensburger premium puzzles! About the Artist: Howard Robinson is known as the artistic master of adorable animals, with detailed illustrations of various creatures brimming with personality, which invariably invoke a smile! Howard says he is living the dream, and that his work and hobbies have become one and the same. Fun for ages 12 and up! Measures approximately 27 x 19.5 inches (70 x 50 cm) when completed. Made in Germany.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Childrens-Jigsaw-Puzzle-Baby-Love-500-Pieces-Puzzle-12001026.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001026_1.webp"], "price": [["17.24", "USD"], ["22.99", "USD"]], "article_num": "12001026", "ean": "4005555010265", "barcode": "4005555010265", "brand": "Ravensburger", "tags": ["puzzles for kids", "animals", "family time"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-kids/baby-love-12001026", "age": "12+"}