{"puzzle_name": "Bunnies and Berries", "num_pieces": 35, "box_dimensions": "10.8\" x 7.6\" x 1.5\"", "puzzle_dimensions": "11.5 x 8.25 inches (29 x 21 cm)", "description": "Get a good look at these “Bunnies and Berries” and watch your child smile in delight as they piece together this adorably sweet scene! It’s a fun time at the bunny fair today with jars of jam and sweet treats on display! Our “Bunnies and Berries” 35-piece jigsaw puzzle shows the respectable rabbit judges ready to indulge in some decadent taste testing and good old-fashioned fun. Give your child an entertaining and enjoyable way to learn new skills with this bright and cheerful illustration. Jigsaw puzzles help develop hand-eye coordination, fine motor skills and problem-solving while delivering tons of tasty fun! This 35-piece puzzle has extra-large, durable pieces little hands can easily hold on to for lots of repeat fun. Clean-cut pieces and Ravensburger’s tight interlocking fit provide a pleasurable puzzling experience for children and their adult helpers alike. With piece counts children can grow with, our Perfect Age Fit criteria ensures this puzzle is fun and educational for ages 4 and up! About the Artist: Sheena Pike is a self-taught Canadian artist who enjoys combining realistic and illustrative styles to create her imaginative and whimsical designs. Fascinated by color since a young child, she takes full advantage of the glorious palette our spectrum offers. In addition to illustrating puzzles, Sheena is a best-selling artist in the cross stitch and diamond painting market. Her work may be found all over the world. Finished puzzle measures approximately 11.5 x 8.25 inches (29 x 21 cm). Made in Czech Republic.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Childrens-Jigsaw-Puzzle-Bunnies-and-Berries-35-Pieces-Puzzle-12004063.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12004063_1.webp"], "price": [["13.99", "USD"]], "article_num": "12004063", "ean": "4005555040637", "barcode": "4005555040637", "brand": "Ravensburger", "tags": ["children", "puzzle", "bunnies", "berries"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-kids/bunnies-and-berries-12004063", "age": "4+"}