{"puzzle_name": "Cozy Boho Studio", "num_pieces": 500, "box_dimensions": "12.1\" x 10\" x 2.7\"", "puzzle_dimensions": "0.1\" x 27.6\" x 19.7\"", "description": "Mix and match your favorite things and add a bit of textured bling — anything goes in this eclectic “Cozy Boho Studio” jigsaw puzzle! Breathe some free-spirited, creativity into your world as you relax with this “Cozy Boho Studio” puzzle! Imagine yourself in this comfy bohemian artist retreat in the heart of New York City, sipping a lovely cup of tea with refreshing lemon. Baxter is patiently waiting for his walk as soon as you take a break from your digital drawing. Perky Peppa is ready to play keep-away, or join in the jaunt. With loads of delightful details to enjoy, good vibes await with every piece of puzzle fun! This 500-piece Large Format jigsaw puzzle combines easy-to-handle, clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! With pieces 20% larger than standard, details are easy to see, so you can complete it in just a day or two. Crafted with an extra-thick backing and our linen-structured paper, the printed image is vibrant, crisp, and glare-free. Create memorable moments with Ravensburger premium puzzles! About the Artist: Olga is a professional artist who takes her inspiration from film, video games and botanical studies. Olga creates artwork in partnership with Artbeat Studio, which is a collective of talented and successful artists offering a variety of art styles and techniques applicable to a range of different products. Fun for ages 12 and up! Measures approximately 27 x 20 inches (70 x 50 cm) when completed. Made in Germany.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Cozy-Boho-Studio-500-Pieces-Puzzle-12001025.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001025_1.webp"], "price": [["22.99", "USD"]], "article_num": "12001025", "ean": "4005555010258", "barcode": "4005555010258", "brand": "Ravensburger", "tags": ["bohemian", "art", "New York City", "puzzle", "relaxation"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/cozy-boho-studio-12001025", "age": "12+"}