{"puzzle_name": "Awesome Athletes", "num_pieces": 300, "box_dimensions": "13.2\" x 9.1\" x 1.5\"", "puzzle_dimensions": "0.1\" x 19.3\" x 14.2\"", "description": "Get in the game with our \"Awesome Athletes\" puzzle! Swing it, block it, dunk it, slug it, kick it — the quest for athletic greatness takes hard work and tons of practice! Whether their sport is tennis, ice hockey, basketball, golf, baseball, snowboarding, football, gymnastics, figure skating, soccer, cycling or something else, your young athlete is sure to enjoy piecing this one together! Puzzles help develop hand-eye coordination, fine motor skills and problem-solving! This 300-piece puzzle has large, durable pieces for lots of repeat fun! Clean-cut pieces and Ravensburger’s tight interlocking fit provide a pleasurable puzzling experience for all. With piece counts children can grow with, our Perfect Age Fit criteria ensures this puzzle is fun and educational for ages 9 and up! About the Artist: Mario Zucca is an artist, illustrator and map-maker working out of his home studio in Philadelphia, PA. He's been illustrating full-time since 2004. His award-winning images have graced the pages of regional and national publications and been featured on products, environmental graphics, and ad campaigns for a number of international brands. Mario has been creating images specific to jigsaw puzzles since 2017 when he licensed his first image to Ravensburger, a map of the national parks entitled “Protect & Preserve USA”.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Awesome-Athletes-300-Pieces-Puzzle-12977.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12977_1.webp"], "price": [["17.99", "USD"]], "article_num": "12977", "ean": "4005556129775", "barcode": "4005556129775", "brand": "Ravensburger", "tags": ["athletes", "sports", "puzzle", "jigsaw", "children", "education"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/awesome-athletes-12977", "age": "9 - 99"}