{"puzzle_name": "Canada City Lights", "num_pieces": 1000, "box_dimensions": "13.2\" x 10\" x 2.2\"", "puzzle_dimensions": "0.1\" x 27.6\" x 19.7\"", "description": "Come skate and celebrate the simple joys of childhood with our “Canadian City Lights” jigsaw puzzle — part of our Canadian Collection series! It’s a cold, snowy night, but that doesn’t stop the neighborhood children from spending their evening ice skating and playing hockey! Join their fun from the cozy warmth of your own home and favorite chair with this “Canadian City Lights” 1000-piece puzzle! Part of our Canadian Collection, renowned artist Katerina Mertikas captures the joy and innocence of children at play with vivid colors and whimsical charm. Makes a wonderful gift for your favorite winter sports fan or outdoor enthusiast! Part of our Canadian Collection series, this 1,000-piece jigsaw puzzle combines captivating imagery with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Our puzzles are crafted with an extra-thick backing and a superior, linen-structured paper, so the printed image is vibrant, crisp, and glare-free. About the Artist: Katerina Mertikas is a self-taught artist who was born in Greece, but has lived much of her life in Ottawa, Canada. She loves creating classic Canadian landscapes and painting popular outdoor pastimes. Always inspired by her two daughters and five grandchildren, Katerina classifies her style as naïve expressionism and focuses on conveying messages of love, peace, innocence, and friendship. Her work is featured in many fine art galleries from coast to coast. Measures approximately 70 x 50 cm (27 x 20 inches) when completed. Made in Germany.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Canada-City-Lights-1000-Pieces-Puzzle-12000828.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12000828_1.webp"], "price": [["24.99", "USD"]], "article_num": "12000828", "ean": "4005555008286", "barcode": "4005555008286", "brand": "Ravensburger", "tags": ["Canadian Collection", "winter sports", "children", "ice skating", "hockey"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/canada-city-lights-12000828", "age": "12+"}