{"puzzle_name": "Jigsaw Puzzle Classic Sonic - 500 Pieces Puzzle", "num_pieces": 500, "box_dimensions": "11.6\" x 9.1\" x 1.5\"", "puzzle_dimensions": "0.1\" x 19.3\" x 14.2\"", "description": "Help our hero rescue his animal friends before the evil villain turns them into robots in our “Sonic the Hedgehog” jigsaw puzzle! Celebrate more than 30 years of “Sonic the Hedgehog” with our ode to the original video game released in 1991! Our 500-piece puzzle features Sonic and his friends, Knuckles and Tails, as the blue hedgehog with supersonic speed travels from zone to zone on South Island, heading to Scrap Brain Zone. Along the way, Sonic destroys robotic hostiles and frees woodland animals. Each chapter concludes with Sonic engaging in a boss fight with the villain, Doctor “Eggman” Robotnik. Fun for any Sonic fan! This 500-piece jigsaw puzzle combines captivating imagery with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Made from 70% or more recycled materials, our puzzles are crafted with an exclusive, extra-thick cardboard backing topped by our superior, linen-structured paper, so the printed image is vibrant, crisp, and glare-free. From fun family times together to long-term health benefits like stress-reducing, mindful moments, there are so many positives about puzzles! They provide a sense of accomplishment and a break from your daily grind, and make a thoughtful birthday or holiday gift. Create memorable moments with Ravensburger premium puzzles today!", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Classic-Sonic-500-Pieces-Puzzle-12001135.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001135_1.webp"], "price": [["19.99", "USD"]], "article_num": "12001135", "ean": "4005555011354", "barcode": "4005555011354", "brand": "Ravensburger", "tags": ["Sonic the Hedgehog", "video games", "fantasy", "adventure"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/classic-sonic-12001135", "age": "12+"}