{"puzzle_name": "Apollo Saturn V Rocket", "num_pieces": 440, "box_dimensions": "14.7\" x 10.8\" x 3.5\"", "puzzle_dimensions": "7.9\" x 7.9\" x 36.1\"", "description": "The largest, highest and heaviest rocket that was ever built. And it took humans to the moon. Start your very own Apollo 11 mission by assembling the legendary Saturn V rocket from jigsaw puzzle pieces to create an impressive 3D model. Just like the original, the finished model also consists of three separate rocket stages. And the removable lunar module along with astronauts even lets you simulate the landing manoeuvre. And then all that’s left to say is, “Houston, the eagle has landed!”. A giant that wrote space travel history: the Saturn V (Saturn 5) rocket. On 16th July 1969, it catapulted Neil Armstrong, the commander of the Apollo 11 mission, and his two astronaut companions into space, turning the ancient dream of landing on the moon into reality. You, too, can be a spacecraft engineer! Assemble the Saturn V and build this impressive 1:120 scale replica of the famous rocket as a 3D jigsaw puzzle. Just like the original, the finished model consists of three separable rocket stages. And the removable lunar lander, the service and command modules along with three little astronaut figurines even let you simulate the mission including the landing manoeuvre. Measuring 36in. (92cm) in height, the rocket model looks highly impressive. The included launch pad acts as a decorative plinth and provides a firm stand at the same time. Moreover, it includes fascinating background information on the Apollo missions and the moon landing as well as spectacular facts about the Saturn V that remains to be one of the largest rockets ever built even more than 50 years after its voyage.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/3D-Puzzle-Building-Apollo-Saturn-V-Rocket-440-Pieces-11545.webp", "https://ravensburger.cloud/images/produktseiten/520x445/11545_1.webp"], "price": [["59.99", "USD"], ["79.99", "USD"]], "article_num": "11545", "ean": "4005556115457", "barcode": "4005556115457", "brand": "Ravensburger", "tags": ["3D puzzles", "space", "Apollo 11", "Saturn V", "rockets"], "product_url": "https://www.ravensburger.us/en-US/products/3d-puzzles/3d-puzzle-buildings/apollo-saturn-v-rocket-11545", "age": "8 - 99"}