{"puzzle_name": "Beautiful Bunny", "num_pieces": 0, "box_dimensions": "7.9\" x 10.4\" x 1.8\"", "puzzle_dimensions": "0.1\" x 7.1\" x 9.4\"", "description": "Brighten your child’s day with a bounty of blossoms, a friendly butterfly and a “Beautiful Bunny” CreArt Painting by Numbers set! Bring out your child’s inner artist with a screen-free activity that’s fun and relaxing! This “Beautiful Bunny” CreArt paint-by-numbers kit comes complete with everything needed to make and display their very own masterpiece. Success is simple, with color-outlined sections and matching, odorless paints to ensure picture-perfect results. Finish in about 4 hours, let dry, then use the included frame to proudly display your budding artist’s talent, or make it a thoughtful gift to a loved one! Looking for a fun activity that keeps your kids off their screens? Help them discover their inner artist with CreArt, our high-quality Painting by Numbers sets! With kid-friendly images designed to match abilities, budding artists can complete a painting in just a few hours. Each section is outlined in its paint color to ensure great results. Painting is a creative activity that may improve dexterity and concentration while providing a sense of satisfaction and relaxing calm! CreArt contains everything children need to create their painting: a high-quality, thick painting board; 14 water-based, opaque acrylic paints in numbered pots; pallet to hold the easy-open/resealable paint pots steady; durable, fine-point paintbrush; easy-to-follow guide sheet; frame to display their finished artwork. Makes a great gift! Made in Czech Republic.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/CreArt-Beautiful-Bunny-Paint-by-numbers-for-kids-7-years-up-20179.webp"], "price": [["19.99", "USD"]], "article_num": "20179", "ean": "4005556201792", "barcode": "4005556201792", "brand": "Ravensburger", "tags": ["paint by number", "kids", "art", "bunny"], "product_url": "https://www.ravensburger.us/en-US/products/art-crafts/paint-by-number-for-kids/beautiful-bunny-20179", "age": "7 - 99"}