{"puzzle_name": "Bridgerton: Season 3", "num_pieces": 500, "box_dimensions": "11.6\" x 9.1\" x 1.5\"", "puzzle_dimensions": "0.1\" x 19.3\" x 14.2\"", "description": "Dearest Readers, indulge in some scandalous good fun with our “Bridgerton: Season 3” jigsaw puzzle! Colin has returned from his travels, only to find his good friend Penelope too busy for him as she attempts to secure herself a husband before she’s hopelessly on the shelf! After her first attempts fail, Colin volunteers to help Penelope, only to realize she’s attracting suitors he’s not ready to see her with. Will Lady Whistledown manage to keep her identity secret from Queen Charlotte and the Ton? Piece together the answers in our “Bridgerton: Season 3” puzzle for hours of regency-era fun! This 500-piece jigsaw puzzle combines captivating imagery with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Made from 70% or more recycled materials, our puzzles are crafted with an exclusive, extra-thick cardboard backing topped by our superior, linen-structured paper, so the printed image is vibrant, crisp, and glare-free. From fun family times together to long-term health benefits like stress-reducing, mindful moments, there are so many positives about puzzles! They provide a sense of accomplishment and a break from your daily grind, and make a thoughtful birthday or holiday gift. Create memorable moments with Ravensburger premium puzzles today!", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Bridgerton-Season-3-500-Pieces-Puzzle-12001230.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001230_1.webp"], "price": [["19.99", "USD"]], "article_num": "12001230", "ean": "4005555012306", "barcode": "4005555012306", "brand": "Ravensburger", "tags": ["Bridgerton", "jigsaw puzzle", "puzzles for adults", "regency-era"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/bridgerton-season-3-12001230", "age": "12+"}