{"puzzle_name": "CreArt Paint by Numbers - Winter Fawn", "num_pieces": 0, "box_dimensions": "6.3\" x 8.7\" x 1.8\"", "puzzle_dimensions": "0.1\" x 5.1\" x 7.1\"", "description": "Same trusted quality, just in our previous packaging—grab it at a great price. Help your child relax and take a break from their busy day with a fun and satisfying activity. Our “Cute Deer” CreArt paint-by-numbers kit comes complete with everything needed to make and display their very own masterpiece, including glittering star gems! Success is simple, with color-outlined sections and matching, odorless acrylic paints to ensure picture-perfect results. Finish in about 4 hours, let dry, then use the included frame to proudly display your budding artist’s talent! Looking for a fun activity that keeps your kids off their screens? Help them discover their inner artist with CreArt, our high-quality Painting by Numbers sets! With kid-friendly images designed to match abilities, budding artists can complete a painting in just a few hours. Each section is outlined in its paint color to ensure great results. Painting is a creative activity that may improve dexterity and concentration while providing a sense of satisfaction and relaxing calm.CreArt contains everything children need to create their painting: a high-quality, thick painting board; 8 water-based opaque acrylic paints in numbered pots; pallet to hold the easy-open/resealable paint pots steady; durable, fine-point paintbrush; easy-to-follow guide sheet; glittering star gems with finish/glue; frame to display their finished artwork. Makes a great gift! Fun for ages 7 and up!", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Ravensburger-CreArt-Paint-by-Numbers-Winter-Fawn-20260.webp", "https://ravensburger.cloud/images/produktseiten/520x445/20260_1.webp"], "price": [["11.24", "USD"], ["14.99", "USD"]], "article_num": "20260", "ean": "4005556202607", "barcode": "4005556202607", "brand": "Ravensburger", "tags": ["paint by numbers", "art", "crafts", "children", "creative"], "product_url": "https://www.ravensburger.us/en-US/products/art-crafts/paint-by-number-for-adults/creart-paint-by-numbers-winter-fawn-20260", "age": "7 - 99"}