{"puzzle_name": "Children’s Jigsaw Puzzle Batman B", "num_pieces": 100, "box_dimensions": "13.2\" x 9.1\" x 1.5\"", "puzzle_dimensions": "0.1\" x 19.3\" x 14.2\"", "description": "Discover the perfect fit! Ravensburger has a puzzle perfect for every child. With interesting imagery and strategic piece size, we have a variety of formats to guarantee success in every age range and ability level! Ravensburger Children's Puzzles are a fun way to train recognition, logical thinking, patience, and hand-eye coordination. Puzzle difficulty when chosen correctly, strengthens your child's self esteem and short term memory while having fun! Since 1891 we've been making the world's finest puzzles in Ravensburg, Germany. Our attention to detail has made Ravensburger the world's greatest puzzle brand! We use an exclusively developed, extra-thick cardboard combined with our fine, linen-structured paper to create a glare-free puzzle image for a quality you can see and feel. Our steel cutting tools are designed and crafted by hand. This ensures that no two pieces are alike and guarantees a perfect interlocking fit. Enjoy Ravensburger quality with this family-friendly activity today! Find pieces, join them together and enjoy the steadily growing image – doing jigsaw puzzles means one little success story after the next. That’s why children love to join together puzzle pieces from their favorite images again and again. But puzzles offer more than fun: if the correct level of difficulty is selected, children of any age can grow with the challenges, increase their patience and strengthen their self-confidence. In the large selection of Ravensburger children’s puzzles with the most popular images, from 2 pieces to 300 pieces, there is guaranteed to be the right one for every child. Selecting the images and the high quality of our children’s puzzles are extremely important to us. Therefore, the safety of all materials is confirmed by an independent institute.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Childrens-Jigsaw-Puzzle-Batman-B-100-Pieces-Puzzle-13262.webp", "https://ravensburger.cloud/images/produktseiten/520x445/13262_1.webp"], "price": [["17.99", "USD"]], "article_num": "13262", "ean": "4005556132621", "barcode": "4005556132621", "brand": "Ravensburger", "tags": ["Batman", "children", "jigsaw puzzle", "fantasy", "adventure"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-kids/batman-b-13262", "age": "6 +"}