{"puzzle_name": "Circle of Colors - Mushrooms", "num_pieces": 500, "box_dimensions": "10.4\" x 10.4\" x 2.2\"", "puzzle_dimensions": "0.1\" x 20.5\" x 20.5\"", "description": "Pick your perfect spot to piece together our “Mushrooms” jigsaw puzzle, part of our “Circle of Colors” series! Did you know that mushrooms are fungi, not plants? The stem and cap are actually the reproductive part (like a plant’s flower or fruit) which scatters the spores. You won’t feel scattered when you spend time on this relaxing “Mushrooms” puzzle! Worked in the round, this circle-shaped puzzle cuts the corners but not the exceptional puzzle experience you’ve come to rely on from Ravensburger. Makes a great gift for your favorite chef or mycologist, or anyone up for a unique puzzle challenge! Part of our Circle of Colors series, this 500-piece jigsaw puzzle combines captivating imagery with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Made from 70% or more recycled materials, our puzzles are crafted with an exclusive, extra-thick cardboard backing along with our superior, linen-structured paper, so the printed image is vibrant, crisp, and glare-free. Create memorable moments with Ravensburger premium puzzles! Fun for ages 12 and up! Measures approximately 20.5 inches (52 cm) diameter when completed. Made in Czech Republic.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Circle-of-Colors-Mushrooms-500-Pieces-Puzzle-12000822.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12000822_1.webp"], "price": [["17.99", "USD"]], "article_num": "12000822", "ean": "4005555008224", "barcode": "4005555008224", "brand": "Ravensburger", "tags": ["mushrooms", "circle of colors", "nature", "puzzles for adults"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/circle-of-colors-mushrooms-12000822", "age": "12 - 99"}