{"puzzle_name": "Blossoming Beauties", "num_pieces": 1000, "box_dimensions": "14.7\" x 10.8\" x 2.2\"", "puzzle_dimensions": "0.1\" x 27.6\" x 19.7\"", "description": "Same trusted quality, just in our previous packaging—grab it at a great price. You can almost smell the heavenly scent coming from these gorgeous blooms! Their cheerful, translucent colors make them practically glow with warmth and delight. Cosmos, morning glories and poppies are just a few of the many favorites you’ll find. Can you see the cute little critters artist Carolyn Gavin has tucked in among the blossoms? Part of our Canadian Collection series — a vibrant puzzle sure to bring you hours of fun and stress-reducing enjoyment! This 1,000-piece jigsaw combines captivating imagery with Ravensburger’s perfect interlocking fit for a most pleasurable puzzle experience! Our puzzles are crafted with an exclusive, extra-thick backing and linen-structured paper so the printed image is crisp and glare-free. Create memorable moments with Ravensburger premium puzzles! About the Artist: Carolyn Gavin is a painter, illustrator and designer based in Toronto, Canada. Vibrant, playful and happy perfectly describe her style. A flower child of the 60s, Carolyn grew up in South Africa, left to travel, then relocated to Canada where she now lives with her family. She works in gouache, watercolor, pen and ink. Finding inspiration in travel, flowers, exotic color and pattern, Carolyn makes sure her life is filled with beauty and creativity. Fun for ages 14 and up! Measures approximately 70 x 50 cm (27 x 19.5 inches) when completed.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Blossoming-Beauties-1000-Pieces-Puzzle-17470.webp", "https://ravensburger.cloud/images/produktseiten/520x445/17470_1.webp"], "price": [["18.74", "USD"], ["24.99", "USD"]], "article_num": "17470", "ean": "4005556174706", "barcode": "4005556174706", "brand": "Ravensburger", "tags": ["flowers", "nature", "puzzles for adults"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/blossoming-beauties-17470", "age": "14 - 99"}