{"puzzle_name": "Cabana Retreat", "num_pieces": 500, "box_dimensions": "12.1\" x 10\" x 2.7\"", "puzzle_dimensions": "0.1\" x 27.6\" x 19.7\"", "description": "Take a dip, catch some waves, or simply lounge around — this \"Cabana Retreat\" is all about you! It’s certainly been a busy day relaxing at this shoreside paradise! The water is warm and the surfboards are handy if you decide to go for a wave. Seashells were abundant when you went scouting — conch, whelks, sand dollars and more — but we’ll leave them behind to help protect the ecosystem. The lounge chairs are waiting with refreshing libations to enjoy while you and your special someone decompress and drink in the glorious sunset. A perfect ending to a perfect day! This 500-piece Large Format jigsaw puzzle combines easy-to-handle, clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience. With pieces 20% larger than standard, details are easy to see so you can complete it in just a day or two. Create memorable moments with Ravensburger premium puzzles! About the Artist: Nancy Wernersbach’s art career began at an early age, thanks to her parents’ gift of 128 Crayola crayons! Her love for painting and capturing nature’s beauty was nurtured at Southampton College, NY, where she earned her BFA. Nancy’s watercolors & oils have won awards in national and regional juried art exhibits. Happy, refreshing, uplifting, and “windows to the outdoors” are words collectors use to describe her work. Now, Nancy brings the same love of nature and adds an element of fun and whimsy to her digital images.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Cabana-Retreat-500-Pieces-Puzzle-16792.webp", "https://ravensburger.cloud/images/produktseiten/520x445/16792_1.webp"], "price": [["22.99", "USD"]], "article_num": "16792", "ean": "4005556167920", "barcode": "4005556167920", "brand": "Ravensburger", "tags": ["beaches", "nature", "leisure", "summer", "animals", "the body and nature", "seasons & holidays", "engineering", "everyday life and work"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/cabana-retreat-16792", "age": "12+"}