{"puzzle_name": "Children’s Jigsaw Puzzle Airport Central - 150 Pieces Puzzle", "num_pieces": 150, "box_dimensions": "13.2\" x 9.1\" x 1.5\"", "puzzle_dimensions": "19.5 x 14.25 inches (49 x 36 cm)", "description": "Pilot your child’s imagination sky-high with our “Airport Central” puzzle and watch them fly with this fun illustration by artist Greg Paprocki! Put your child in the pilot’s seat, where they can imagine flying all of these planes — how neat! Our “Airport Central” puzzle shows a very busy place, with planes arriving and departing at a very fast pace. The food service truck is loading a plane with meals for the flight; there’s dinner and breakfast since they’ll fly overnight. Passengers are boarding their plane in a line and are hoping their suitcases make it onboard just fine. A fun puzzle for your future pilot! This 150-piece puzzle has large, durable pieces for lots of repeat fun! Clean-cut pieces and Ravensburger’s tight interlocking fit provide a pleasurable puzzling experience for all. Puzzles help develop hand-eye coordination, fine motor skills and problem-solving through repeated practice. With piece counts children can grow with, our Perfect Age Fit criteria ensure this puzzle is fun and educational for ages 7 and up! About the Artist: A prolific artist, Greg Paprocki always pushes the limits of his imagination. His creativity, drive and careful attention to detail is reflected in his distinctive art. Though he is a one-man shop, Greg’s polished, inventive work evokes the skill set of an entire team of artists, and his talent is evident in the many memorable illustrations he’s created.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Childrens-Jigsaw-Puzzle-Airport-Central-150-Pieces-Puzzle-12004134.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12004134_1.webp"], "price": [["16.99", "USD"]], "article_num": "12004134", "ean": "4005555041344", "barcode": "4005555041344", "brand": "Ravensburger", "tags": ["Engineering", "Everyday Life", "Work", "Vehicles", "Airplanes"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-kids/airport-central-12004134", "age": "7+"}