{"puzzle_name": "CreArt Serie Junior: 2 x Peppa Pig", "num_pieces": 0, "box_dimensions": "13.2\" x 9.1\" x 1.5\"", "puzzle_dimensions": "0.1\" x 8.7\" x 12.6\"", "description": "Add a splash of fun to your child’s day with “Peppa Pig” CreArt Junior Painting by Numbers featuring brother George and best friend Rebecca Rabbit! Peppa Pig loves muddy puddles, and your child will love creating these adorable paintings! Our CreArt Junior paint-by-number kit comes complete with everything needed to make their very own masterpieces. Success is simple, with large, color-outlined sections to stay engaged and see results fast. Each area is numbered to matching paints, ensuring picture-perfect results. Fun, preprinted borders mean you can hang up their paintings in no time to proudly display your budding artist’s talent! Oink! Looking for a fun activity that keeps your kids off their screens? Help them discover their inner artist with CreArt Junior, our high-quality Painting by Numbers sets! Kid-friendly images and age-appropriate sized spaces help budding artists stay engaged to complete their paintings. Each large section is outlined in its coordinating paint color to ensure great results. Painting is a creative activity that may improve dexterity and concentration while providing a sense of satisfaction and relaxing calm.CreArt Junior contains everything children need to create their paintings: 2 thick painting boards; 5 water-based odorless acrylic paints in numbered pots; pallet to hold the easy-open/resealable paint pots steady; a shorter, sturdier, flat-bristled wooden paintbrush designed to fit little hands; and an easy-to-follow guide sheet. Makes a great gift!Fun for ages 5 and up!", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/CreArt-CreArt-Serie-Junior-2-x-Peppa-Pig-Paint-by-numbers-for-kids-5-years-up-23570.webp", "https://ravensburger.cloud/images/produktseiten/520x445/23570_1.webp"], "price": [["17.99", "USD"]], "article_num": "23570", "ean": "4005556235704", "barcode": "4005556235704", "brand": "Ravensburger", "tags": ["Peppa Pig", "paint by numbers", "kids", "art", "crafts"], "product_url": "https://www.ravensburger.us/en-US/products/art-crafts/paint-by-number-for-kids/creart-serie-junior-2-x-peppa-pig-23570", "age": "5 - 7"}