{"puzzle_name": "Canadian Collection: Greenspond Harbour", "num_pieces": 1000, "box_dimensions": "13.2\" x 10\" x 2.2\"", "puzzle_dimensions": "0.1\" x 27.6\" x 19.7\"", "description": "Slip into a simple, satisfying life in bucolic 'Greenspond Harbour!' With all the hustle and bustle of our modern world, there’s much appeal to living a simpler life. Canadian artist Ed Roche perfectly captures the sense of peace and tranquility in this quaint Newfoundland fishing village. Ed shares, “You start with a blank canvas. And when you finish painting, the goal is to be left with an image you can walk into. You have to be able to recreate the energy of a community, and without that heart and soul, well, it’s just another painting.” Part of our Canadian Collection series — an idyllic scene you’re sure to find simple pleasure in puzzling! This 1,000-piece jigsaw puzzle combines captivating imagery with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience. Create memorable moments with Ravensburger premium puzzles! About the Artist: For more than 25 years, Ed Roche has been creating stunning portraits of island life in his home province of Newfoundland and Labrador. He considers St. John’s his home and Newfoundland his backyard. He regularly roams the shorelines and ventures into all the island’s nooks and crannies finding inspiration for his paintings. Each piece is a celebration of the people of Newfoundland and Labrador and their unique heritage, culture, and traditions.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Canadian-Collection-Greenspond-Harbour-1000-Pieces-Puzzle-12000558.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12000558_1.webp"], "price": [["24.99", "USD"]], "article_num": "12000558", "ean": "4005555005582", "barcode": "4005555005582", "brand": "Ravensburger", "tags": ["jigsaw puzzle", "Canadian Collection", "Greenspond Harbour", "art", "landscape"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/canadian-collection-greenspond-harbour-12000558", "age": "14+"}