{"puzzle_name": "Amazing Amphibians", "num_pieces": 35, "box_dimensions": "10.8\" x 7.6\" x 1.5\"", "puzzle_dimensions": "0.1\" x 10.2\" x 7.1\"", "description": "Can you breathe and absorb water through your skin? Our array of \"Amazing Amphibians\" can! There’s nothing puzzling about how cool these cold-blooded amphibians are! A red-eyed tree frog is joined by a colorful variety of poison dart frogs, both real and imagined (the rainbow one), as well as a fire salamander and insects. Most frogs are nocturnal, but these colorful bodies warn other animals, “Don’t eat me!” so they are active during the day! Puzzles help develop hand-eye coordination, fine motor skills and problem-solving through repeated practice while delivering leaps of fun! Did you know a group of poison frogs is called an army? They measure from less than 1.5” to almost 2.5” long. Some of the species here include: blue poison dart (bottom left), red striped poison dart frog (right side) and a dyeing dart frog (bottom right). The red-eyed tree frog (center) has large suction-cup pads to climb and cling to branches and leaves. And if a predator grabs a fire salamander (bottom center) by its tail, toe or leg, it can break off that limb and grow a new one to replace it! This 35-piece puzzle has extra-large, durable pieces little hands can easily hold on to for lots of repeat fun. Clean-cut pieces and Ravensburger’s tight interlocking fit provide a pleasurable puzzling experience for children and their adult helpers alike. With piece counts children can grow with, our Perfect Age Fit criteria ensures this puzzle is fun and educational for ages 4 and up!", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Childrens-Jigsaw-Puzzle-Amazing-Amphibians-35-Pieces-Puzzle-05174.webp", "https://ravensburger.cloud/images/produktseiten/520x445/05174_1.webp"], "price": [["13.99", "USD"]], "article_num": "05174", "ean": "4005556051748", "barcode": "4005556051748", "brand": "Ravensburger", "tags": ["animals", "nature", "puzzles for kids"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-kids/amazing-amphibians-05174", "age": "3 +"}