{"puzzle_name": "All Seasons Flower Shop", "num_pieces": 1000, "box_dimensions": "13.2\" x 10\" x 2.2\"", "puzzle_dimensions": "0.1\" x 27.6\" x 19.7\"", "description": "Breathe in the heady fragrance found in the “All Seasons Flower Shop” and enjoy a lovely jigsaw puzzle by artist Lars Stewart! Make a bouquet of your favorite blooms when you visit the “All Seasons Flower Shop”! Lar Stewart’s gorgeous illustration lets you piece together a rainbow of peonies, tulips, roses, Gerbera daisies, sunflowers, mums and more. Which are your favorites? Or would you choose a hanging basket with million bells or fascinating fuchsia? The kitty cat named Dianthus has a gift for you, minus a few petals! Take some me-time and puzzle this lovely scene for hours of delightful, stress-reducing fun! This 1,000-piece jigsaw puzzle combines captivating imagery with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Made from 70% or more recycled materials, our puzzles are crafted with an exclusive, extra-thick backing along with our superior, linen-structured paper, so the printed image is vibrant, crisp, and glare-free. Create memorable moments with Ravensburger premium puzzles! About the Artist: In 2015, Lars Stewart turned his passion for photography into his profession. His works are colorful photographic montages of classical photography and digital art. Lars lives in Washington State in the USA, where he and his wife/artist colleague Aimee Stewart work together at Foxfire Studios. Fun for ages 14 and up! Measures approximately 27 x 19.5 inches (70 x 50 cm) when completed. Made in Germany.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-All-Seasons-Flower-Shop-1000-Pieces-Puzzle-12001262.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001262_1.webp"], "price": [["24.99", "USD"]], "article_num": "12001262", "ean": "4005555012627", "barcode": "4005555012627", "brand": "Ravensburger", "tags": ["flowers", "puzzle", "art", "Lars Stewart"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/all-seasons-flower-shop-12001262", "age": "14+"}