{"puzzle_name": "Canada Jigsaw Nationals: Indigo Forest", "num_pieces": 1000, "box_dimensions": "13.2\" x 10\" x 2.2\"", "puzzle_dimensions": "27 x 20 inches (70 x 50 cm)", "description": "Find magical moments of tranquility listening to a babbling brook and being one with nature in our luminous “Indigo Forest” jigsaw puzzle! Immerse yourself into the rich jewel tones imbued in our “Indigo Forest” 1000-piece puzzle for hours of soothing fun! Like a walk in nature, artist Redina Tili’s clever use of layered textures gives her work a 3-D effect that suggests movement while evoking feelings of calm and joy. Did you spot the swan nesting on the opposite bank? This serene scene was completed in the Teams Qualifier Round at the 2025 Canadian Jigsaw Nationals speed-puzzling competition! This 1,000-piece jigsaw puzzle combines captivating imagery with our exclusive, extra-thick cardboard backing, clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Create memorable moments with Ravensburger premium puzzles! About the Artist: Redina Tili’s start as a sculptor continues to influence her paintings as she includes dimensional elements. After receiving a BFA degree from the Fine Art Academy in Albania, Redina traveled throughout Europe, showcasing her music and art before moving to Canada in the late 90’s. There, she continues to create paintings, sculptures, and designs honoring nature. Fun for ages 14 and up! Measures approximately 27 x 20 inches (70 x 50 cm) when completed. Made in Germany.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Canada-Jigsaw-Nationals-Indigo-Forest-1000-Pieces-Puzzle-12001643.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001643_1.webp"], "price": [["24.99", "USD"]], "article_num": "12001643", "ean": "4005555016434", "barcode": "4005555016434", "brand": "Ravensburger", "tags": ["nature", "jigsaw puzzle", "Indigo Forest", "puzzles for adults"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/canada-jigsaw-nationals-indigo-forest-12001643", "age": "14+"}