{"puzzle_name": "Challenge Puzzle Star Wars", "num_pieces": 1000, "box_dimensions": "13.2\" x 10\" x 2.2\"", "puzzle_dimensions": "0.1\" x 27.6\" x 19.7\"", "description": "Fulfill your destiny and give in to the Dark Side to complete our “Challenge Puzzle Star Wars”! Search your feelings (and through a thousand puzzle pieces) to bring Lord Vader his life-sustaining armor and lethal light saber! An homage to the original movie trilogy, our illustration portrays Darth Vader as he appeared in A New Hope, The Empire Strikes Back, and Return of the Jedi. With over 100 Stormtroopers protecting him, this mostly monochromatic puzzle collage will prove a challenge for novices and avid puzzlers alike, even those who are strong with the Force! This 1,000-piece jigsaw puzzle combines captivating imagery with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Our puzzles are crafted with an exclusive, extra-thick cardboard backing along with our superior, linen-structured paper, so the printed image is vibrant, crisp, and glare-free. Create memorable moments with Ravensburger premium puzzles! Fun for ages 14 and up! Measures approximately 70 x 50 cm (27 x 19.5 inches) when completed.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Challenge-Puzzle-Star-Wars-1000-Pieces-Puzzle-12000458.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12000458_1.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12000458_2.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12000458_3.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12000458_4.webp"], "price": [["29.99", "USD"]], "article_num": "12000458", "ean": "4005555004585", "barcode": "4005555004585", "brand": "Ravensburger", "tags": ["Star Wars", "fantasy", "adventure"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/challenge-puzzle-star-wars-12000458", "age": "14+"}