{"puzzle_name": "Atmospheric London", "num_pieces": 2000, "box_dimensions": "17.1\" x 11.9\" x 2.2\"", "puzzle_dimensions": "0.1\" x 38.6\" x 29.5\"", "description": "Discover the perfect fit! From 500 piece to the world’s-largest 40,320 piece puzzle – and everything in between – Ravensburger has something for everyone! Choose from landscapes, monuments, works of art, history, maps, animals, and more – each colorful design is constructed with our exclusive materials and specially-designed tools to ensure the highest quality puzzling experience. Once you’ve tried our extra-thick, extra-durable cardboard, glare-free linen paper, and perfect, interlocking fit, you’ll know why Ravensburger is the puzzle of choice around the world. Ravensburger Puzzles are a fun way to keep you sharp by strengthening your logical thinking and short term memory while having fun! Since 1891 we've been making the world's finest puzzles in Ravensburg, Germany. Our attention to detail has made Ravensburger the world's greatest puzzle brand! We use an exclusively developed, extra-thick cardboard combined with our fine, linen-structured paper to create a glare-free puzzle image for a quality you can see and feel. Our steel cutting tools are designed and crafted by hand. This ensures that no two pieces are alike and guarantees a perfect interlocking fit. Enjoy Ravensburger quality with this family-friendly activity today! Ravensburger Puzzles means puzzle fun in premium quality. For beginners who feel comfortable with a small number of pieces, for advanced puzzlers who prefer a medium challenge, and of course for absolute professionals who don't shy away from 40,320 pieces. Thanks to the enormous variety of motifs in the Ravensburger puzzle range, nothing stands in the way of an unforgettable puzzle experience. The uniqueness of the characteristic puzzle pieces is achieved by handcrafted cutting tools, which are manufactured with extreme precision in Ravensburg, Upper Swabia. Decades of experience in puzzle production and high quality standards for materials, motifs, and design make puzzle lovers' hearts beat faster and allow them to experience how one piece fits into another. That is Ravensburger's passion for quality.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Atmospheric-London-2000-Pieces-Puzzle-16627.webp", "https://ravensburger.cloud/images/produktseiten/520x445/16627_1.webp"], "price": [["39.99", "USD"]], "article_num": "16627", "ean": "4005556166275", "barcode": "4005556166275", "brand": "Ravensburger", "tags": ["Discover the World", "Countries", "Cities"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/atmospheric-london-16627", "age": "14+"}