{"puzzle_name": "Abandoned Places: Decaying Diner", "num_pieces": 1000, "box_dimensions": "13.2\" x 10\" x 2.2\"", "puzzle_dimensions": "27.6\" x 19.7\"", "description": "Pull up a stool and stay awhile — if you dare! There’s dust coffee and fossilized pie on the menu in this “Decaying Diner” puzzle! It looks like time and customers have passed on by this southwest diner! It’s sure been years since that coffee pot’s been perking, and the jukebox is stocked with grandpa’s favorites from the ‘50s and ‘60s! Once upon a time there were beefy burgers sizzling on the grill and thirst-quenching root beer floats delivered to booths of long-haul truckers and weary families. Now the scorching sun beats down on this “Decaying Diner” as it disappears into the desert — part of our fun Abandoned Series! This 1,000-piece jigsaw puzzle combines captivating imagery with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Our puzzles are crafted with an exclusive, extra-thick backing along with our superior, linen-structured paper, so the printed image is vibrant, crisp, and glare-free. Create memorable moments with Ravensburger premium puzzles! About the Artist: Eduard studied Graphic Design at the Kharkiv Academy of Arts in Ukraine. He moved from the city of Donetsk in 2014 and now lives in Poltava. Drawing inspiration from his favorite artist Albrecht Dürer, Eduard produced artwork for numerous magazines. He later transitioned to computer game design and then joined Artbeat Studio, a collective of talented and successful artists. Fun for ages 14 and up! Measures approximately 27 x 19.5 inches (70 x 50 cm) when completed.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Abandoned-Places-Decaying-Diner-1000-Pieces-Puzzle-12000637.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12000637_1.webp"], "price": [["24.99", "USD"]], "article_num": "12000637", "ean": "4005555006374", "barcode": "4005555006374", "brand": "Ravensburger", "tags": ["Fantasy & Adventure", "Gothic", "Horror"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/abandoned-places-decaying-diner-12000637", "age": "14+"}