{"puzzle_name": "CreArt Best Friends - Paint by numbers for kids 7 years up", "num_pieces": 0, "box_dimensions": "6.3\" x 8.7\" x 1.8\"", "puzzle_dimensions": "0.1\" x 5.1\" x 7.1\"", "description": "Encourage your sweet child or grandchild to dabble in the arts with our darling CreArt “Delightful Deer” Painting by Numbers set with glittering gems! Let kids add some dazzle to their down time with this “Delightful Deer” CreArt paint-by-numbers kit! They can relax with this fun and satisfying activity, complete with everything needed to make and display their very own masterpiece, including glittering gems! Success is simple, with color-outlined sections and matching, odorless acrylic paints to ensure picture-perfect results. Finish in about 4 hours, let dry, then use the included frame to proudly display your budding artist’s talent! Looking for a fun activity that keeps your kids off their screens? Help them discover their inner artist with CreArt, our high-quality Painting by Numbers sets! With kid-friendly images designed to match abilities, budding artists can enjoy completing their very own painting in just a few hours. Easy-to-see colored outlines distinguish each section, helping kids achieve great results. Painting is a fun, creative activity that can also improve dexterity and concentration while providing a sense of satisfaction! CreArt contains everything children need to create their painting: a high-quality, thick painting board; 10 water-based, opaque acrylic paints in numbered pots; pallet to hold the easy-open/resealable paint pots steady; durable, fine-point paintbrush; easy-to-follow guide sheet; glittering gems with finish/glue; and frame to display their finished artwork. Makes a great gift!", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/CreArt-Best-Friends-Paint-by-numbers-for-kids-7-years-up-20072.webp", "https://ravensburger.cloud/images/produktseiten/520x445/20072_1.webp"], "price": [["14.99", "USD"]], "article_num": "20072", "ean": "4005556200726", "barcode": "4005556200726", "brand": "Ravensburger", "tags": ["paint by number", "kids", "art", "crafts"], "product_url": "https://www.ravensburger.us/en-US/products/art-crafts/paint-by-number-for-kids/best-friends-20072", "age": "7 - 99"}