{"puzzle_name": "Construction at the Airport", "num_pieces": 100, "box_dimensions": "13.2\" x 9.1\" x 1.5\"", "puzzle_dimensions": "0.1\" x 19.3\" x 14.2\"", "description": "The fun keeps rolling as you help pave a new tarmac and build a new terminal with our “Construction at the Airport” puzzle! Since 1891 we've been making the finest puzzles and it's our attention to detail, which makes Ravensburger the world's greatest puzzle brand. Experience a puzzle quality your child can grow with - piece by piece. Ravensburger puzzle pieces are extra durable to withstand the demands of little hands. Puzzle play is a wonderful way for children to have fun while developing physical, cognitive, and emotional skills. As kids work at solving puzzles, they are developing fine and gross motor skills and hand-eye coordination. They develop problem-solving skills and learn to think logically. Puzzles also help with shape recognition and help to enhance memory. Puzzle play encourages goal setting and patience—both of which are rewarded when the puzzle is completed. Puzzling also promotes unplugged play, providing opportunities to socially interact and connect without the use of technology. We care about our footprint on the environment. All the materials used in our puzzles come from sustainable resources and are either recyclable or stem from recycled sources. Trees used in the production of our cardboard come from FSC certified sources and sustainably managed forests.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Childrens-Jigsaw-Puzzle-Construction-at-the-Airport-100-Pieces-Puzzle-10624.webp", "https://ravensburger.cloud/images/produktseiten/520x445/10624_1.webp"], "price": [["11.04", "USD"], ["16.99", "USD"]], "article_num": "10624", "ean": "4005556106240", "barcode": "4005556106240", "brand": "Ravensburger", "tags": ["engineering", "everyday life", "work", "construction site"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-kids/construction-at-the-airport-10624", "age": "6+"}