{"puzzle_name": "Amazing Nature", "num_pieces": 750, "box_dimensions": "10.4\" x 10.4\" x 2.2\"", "puzzle_dimensions": "0.1\" x 19.7\" x 19.7\"", "description": "Enter this peaceful paradise and indulge in a well-deserved break as you relax with our “Amazing Nature” jigsaw puzzle! Enter a new dimension and spend time in nature even if you live in the heart of the city with our “Amazing Nature” puzzle! Waterfalls abound and each archway takes you to a new world of wonder. Where would you go if you could? This lush scene is complete with tropical hibiscus and fragrant oranges ripe for the picking. Will the woman hiding in the flora pass one to the blue panther? It’s probably a good idea! Let this 750-piece puzzle provide some relaxing relief from your demanding day! Take a mindful moment to refresh your inner-self and restore balance with an intriguing image from our Art & Soul series! With themes from nature to out-of-this-world fun, each 750-piece jigsaw puzzle combines a captivating illustration with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience. Made from 70% or more recycled materials, our puzzles are crafted with an exclusive, extra-thick backing topped with superior, linen-structured paper for a vibrant, crisp, and glare-free image. Create memorable moments with Ravensburger premium puzzles! Fun for ages 12 and up! Measures approximately 20 x 20 inches (50 x 50 cm) when completed. Made in Germany.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Amazing-Nature-750-Pieces-Puzzle-12000999.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12000999_1.webp"], "price": [["19.99", "USD"]], "article_num": "12000999", "ean": "4005555009993", "barcode": "4005555009993", "brand": "Ravensburger", "tags": ["nature", "puzzle", "relaxation", "art", "creativity"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/amazing-nature-12000999", "age": "14+"}