{"puzzle_name": "A Traveler's Animal Journal", "num_pieces": 1000, "box_dimensions": "13.2\" x 10\" x 2.2\"", "puzzle_dimensions": "27 x 19.5 inches (70 x 50 cm)", "description": "Capture some quality “me-time” as you pass many pleasurable hours with pictures of the cutest critters in “A Traveler’s Animal Journal” puzzle! Travel from South America to South Africa and see adorable animals from around the world! From the teeny-tiny finger monkey to the large-eared fennec fox, these critters are surely some of the cutest on the planet. Who knew Quokkas, those small marsupials native to Australia, love to smile? There’s also a red panda and a marbled polecat, an armadillo girdled lizard and an axolotl. And just where did that strawberry poison dart frog come from? A fun puzzle and a perfect gift for any animal-lover! This 1,000-piece jigsaw puzzle combines captivating imagery with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Our puzzles are crafted with an exclusive, extra-thick backing along with our superior, linen-structured paper, so the printed image is vibrant, crisp, and glare-free. Create memorable moments with Ravensburger premium puzzles! About the Artist: Howard Robinson is known as the artistic master of adorable animals, with detailed illustrations of various creatures brimming with personality, which invariably invoke a smile! Howard says he is living the dream, and that his work and hobbies have become one and the same. Fun for ages 14 and up! Measures approximately 27 x 19.5 inches (70 x 50 cm) when completed.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-A-Travelers-Animal-Journal-1000-Pieces-Puzzle-12000607.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12000607_1.webp"], "price": [["24.99", "USD"]], "article_num": "12000607", "ean": "4005555006077", "barcode": "4005555006077", "brand": "Ravensburger", "tags": ["animals", "the body", "nature", "forest", "environment", "weather & climate", "wilderness"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/a-traveler-s-animal-journal-12000607", "age": "14+"}