{"puzzle_name": "Ravensburger Cozy Cabana", "num_pieces": 0, "box_dimensions": "17.1\" x 13.2\" x 1.6\"", "puzzle_dimensions": "0.1\" x 15.8\" x 11.8\"", "description": "Picture yourself lounging the day away at your personal tropical paradise as you paint this “Cozy Cabana” with a CreArt Painting by Numbers set! Take a vacation from your daily stress by painting this “Cozy Cabana” retreat on a beautiful beach with the CreArt paint-by-number kit! Relax your mind and go to your peaceful place with no screens and no demands as you fill in each clearly numbered section, bit by bit. High-quality, odorless acrylic paints ensure excellent results. When finished, hang it as a gentle reminder to take time to sit back and relax. De-stress and find success as you discover the joy of art in your heart today! Enjoy the relaxing and rewarding experience of creating art without the pressure of facing a blank canvas! Just as great cooks follow recipes to make delicious dishes, the prepared patterns in this Painting by Numbers set lets you create a personal masterpiece you’ll be proud to display. A meditative activity, painting can help relieve the stress of the day while providing a satisfying sense of accomplishment! With the same dependable quality you’ve come to know in our puzzles and games, this premium paint-by-number kit comes with everything you need: a durable, smooth white painting board with clearly numbered sections; 32 easy-open/close water-based, odorless acrylic paints in matching numbered pots; finishing gloss; dual-tipped, wood-handle paintbrush with fine points (#1, #2) for precise details; artist pallet to keep paint pots steady; and easy-to-follow guide sheet.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Ravensburger-Cozy-Cabana-20276.webp", "https://ravensburger.cloud/images/produktseiten/520x445/20276_1.webp"], "price": [["26.24", "USD"], ["34.99", "USD"]], "article_num": "20276", "ean": "4005556202768", "barcode": "4005556202768", "brand": "Ravensburger", "tags": ["paint by number", "art", "relaxation", "tropical", "beach"], "product_url": "https://www.ravensburger.us/en-US/products/art-crafts/paint-by-number-for-adults/cozy-cabana-20276", "age": "12+"}