{"puzzle_name": "Astrological Diner", "num_pieces": 750, "box_dimensions": "10.4\" x 10.4\" x 2.2\"", "puzzle_dimensions": "19.7\" x 19.7\"", "description": "Grab a donut, pour a cup of joe and enjoy a cosmic good time as you solve our “Astrological Diner” jigsaw puzzle! Welcome to the “Astrological Diner” where the stars have aligned for this Sagittarius and Gemini space explorer couple! All signs point to some astronomical puzzle fun, and this may just be the place to meet your future life partner. It’s definitely destined to bring you hours of relaxing fun! Did you know solving puzzles not only reduces stress and anxiety but also puts your mind in a meditative state? Just the thing to escape from the stresses of your day and shoot for the stars! Take a mindful moment to refresh your inner-self and restore balance with an intriguing image from our Art & Soul series! With themes from nature to out-of-this-world fun, each 750-piece jigsaw puzzle combines a captivating illustration with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience. Made from 70% or more recycled materials, our puzzles are crafted with an exclusive, extra-thick backing topped with superior, linen-structured paper for a vibrant, crisp, and glare-free image. Create memorable moments with Ravensburger premium puzzles! Fun for ages 12 and up! Measures approximately 20 x 20 inches (50 x 50 cm) when completed. Made in Germany.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Astrological-Diner-750-Pieces-Puzzle-12001000.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001000_1.webp"], "price": [["14.99", "USD"], ["19.99", "USD"]], "article_num": "12001000", "ean": "4005555010005", "barcode": "4005555010005", "brand": "Ravensburger", "tags": ["design", "art", "creativity", "everyday life"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/astrological-diner-12001000", "age": "14+"}