{"puzzle_name": "Jigsaw Puzzle Bridgerton", "num_pieces": 300, "box_dimensions": "7.5\" x 7.5\" x 1.9\"", "puzzle_dimensions": "0.1\" x 13\" x 8.3\"", "description": "Amidst the puzzle's assembly, characters are pieced together, each expression and pose reflecting their roles in the captivating drama. With each section completed, the puzzle transforms into a vibrant tapestry of characters in splendid period attire, and the opulent grandeur of the Bridgerton estate. Have you searched through your favorite series and can't find a new season? No need to panic! Here comes the sequel! Get the new 300-piece puzzles from Ravensburger and let your favorite characters move right into your home! For example, Stitch, the cute alien, or the clever, sometimes slightly murderous Wednesday. Puzzling is like streaming in your head—so what are you waiting for? Switch off everyday life and start the movie! Ravensburger puzzles mean premium quality puzzle fun. They are backed by decades of experience in puzzle production and high standards for materials, motifs, and design. The characteristic puzzle pieces are made with punching tools that are still manufactured today with extreme precision in Ravensburg, Upper Swabia. This passion for quality, attention to detail, and a huge selection of motifs make Ravensburger puzzles so unique and guarantee an unforgettable puzzle experience. From beginners to professionals: every puzzle lover will find the perfect puzzle here!", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Bridgerton-300-Pieces-Puzzle-12001229.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001229_1.webp"], "price": [["9.99", "USD"]], "article_num": "12001229", "ean": "4005555012290", "barcode": "4005555012290", "brand": "Ravensburger", "tags": ["Bridgerton", "puzzle", "jigsaw", "300 pieces", "adult puzzles"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/bridgerton-12001229", "age": "8+"}