{"puzzle_name": "City of Love", "num_pieces": 0, "box_dimensions": "13.2\" x 17.1\" x 1.6\"", "puzzle_dimensions": "0.1\" x 11.8\" x 15.8\"", "description": "Journey to romantic Paris where the Eiffel Tower glows in the “City of Love” in this colorful and inviting CreArt Painting by Numbers set! Even the stars agree — Paris is the “City of Love”, with a heart-shaped constellation highlighting the Eiffel Tower! This CreArt paint-by-number kit treats you to relaxing “me time”, with everything you need included. Simply fill in each clearly numbered section and watch the image emerge! The prepared patterns and high-quality, odorless acrylic paints ensure excellent results as you create your personal masterpiece. De-stress and find success as you discover the joy of art in your heart today! Enjoy the relaxing and rewarding experience of creating art without the pressure of facing a blank canvas! The prepared patterns in this Painting by Numbers set lets you create a personal masterpiece you’ll be proud to display. A meditative activity, painting can help relieve the stress of the day while providing a satisfying sense of accomplishment! With the same dependable quality you’ve come to know in our puzzles and games, this premium paint-by-number kit comes with everything you need: a durable, smooth white painting board with clearly numbered sections; easy-open/close water-based, odorless acrylic paints in matching numbered pots; finishing gloss; dual-tipped, wood-handle paintbrush with fine points (#1, #2) for precise details; artist pallet to keep paint pots steady; and easy-to-follow guide sheet. Frame not included. Made in Czech Republic.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Ravensburger-City-of-Love-23624.webp", "https://ravensburger.cloud/images/produktseiten/520x445/23624_1.webp"], "price": [["26.24", "USD"], ["34.99", "USD"]], "article_num": "23624", "ean": "4005556236244", "barcode": "4005556236244", "brand": "Ravensburger", "tags": ["paint by number", "art", "Paris", "Eiffel Tower"], "product_url": "https://www.ravensburger.us/en-US/products/art-crafts/paint-by-number-for-adults/city-of-love-23624", "age": "12+"}