{"puzzle_name": "Autumn Riches", "num_pieces": 500, "box_dimensions": "12.1\" x 10\" x 2.7\"", "puzzle_dimensions": "27.6\" x 19.7\"", "description": "Soothe your soul and spend some quiet time contemplating nature’s colorful treasures with our “Autumn Riches” 500-piece Large Format puzzle! Tuck yourself in a comfy chair with your favorite throw and enjoy some relaxing hours with our “Autumn Riches” jigsaw puzzle! Just as Mother Nature tucks her deciduous trees in for their winter rest, you deserve a break before the hectic holiday season arrives. This richly colorful illustration, complete with beautiful leaves, acorns and pinecones, comes from the vivid imagination of artist Michael David Ward. This fall, take a puzzle break to rest, recharge and destress! Enjoy! This 500-piece Large Format jigsaw puzzle combines captivating imagery with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Crafted with an exclusive, extra-thick cardboard backing and superior, linen-structured paper so the printed image is vibrant, crisp, and glare-free. Create memorable moments with Ravensburger premium puzzles! About the Artist: Michael David Ward is a Japanese American artist/writer who has created many commemorative images for major movie studios. A published fine-artist of multiple genres, he is also a graphic and industrial designer. In addition to his artistic endeavors, Michael is a science fiction/fantasy writer whose philosophy is, “Creativity is intrinsic to our being!” Fun for ages 12 and up! Measures approximately 27 x 19.5 inches (70 x 50 cm) when completed. Made in Germany.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Autumn-Riches-pieceCount-Pieces-Puzzle-12001681.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001681_1.webp"], "price": [["24.99", "USD"]], "article_num": "12001681", "ean": "4005555016816", "barcode": "4005555016816", "brand": "Ravensburger", "tags": ["nature", "autumn", "puzzle", "jigsaw"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/autumn-riches-12001681", "age": "12+"}