{"puzzle_name": "Bird Watching", "num_pieces": 750, "box_dimensions": "10.4\" x 10.4\" x 2.2\"", "puzzle_dimensions": "19.7\" x 19.7\"", "description": "Keep your eye on the birdie as you piece together this colorful collection of flowers and feathered friends in our fantastical “Bird Watching” puzzle! Prioritize your well-being and take time from your busy day to clear your mind with some well-deserved puzzle time! The rich jewel tones of our lovely “Bird Watching” jigsaw puzzle is the perfect antidote to your stressful day. Perched among gorgeous blooms, these imagined birds will help you while away the hours as you feel the satisfaction of clicking each piece in place. When complete, the bright image makes a perfect piece to add a pop of decorative color your space! Take a mindful moment to refresh your inner-self and restore balance with an intriguing image from our Art & Soul series! With themes from nature to out-of-this-world fun, each 750-piece jigsaw puzzle combines a captivating illustration with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience. Made from 70% or more recycled materials, our puzzles are crafted with an exclusive, extra-thick backing topped with superior, linen-structured paper for a vibrant, crisp, and glare-free image. Create memorable moments with Ravensburger premium puzzles! Fun for ages 12 and up! Measures approximately 20 x 20 inches (50 x 50 cm) when completed. Made in Germany.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Bird-Watching-750-Pieces-Puzzle-12000998.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12000998_1.webp"], "price": [["14.99", "USD"], ["19.99", "USD"]], "article_num": "12000998", "ean": "4005555009986", "barcode": "4005555009986", "brand": "Ravensburger", "tags": ["nature", "birds", "puzzle", "art", "creativity"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/bird-watching-12000998", "age": "14+"}