{"puzzle_name": "Beautiful Ocean", "num_pieces": 100, "box_dimensions": "13.2\" x 9.1\" x 1.5\"", "puzzle_dimensions": "0.1\" x 19.3\" x 14.2\"", "description": "Break through boredom like this orca breaches the water with our “Beautiful Ocean” puzzle filled with dolphins, sea lions, a sea turtle and more! This wonderfully colourful puzzle shows life above and below the waves. Above the waves we can see different sea birds, a crab, starfish and a killer whale leaping out of the water; below the waves is a range of tropical fish, a turtle, dolphins and star fish. The huge amount of detail and colour within this design will ensure plenty of fun for puzzle fans. Suitable for anyone who prefer puzzles with large pieces. Our 100 piece kids puzzles with XXL large pieces are crafted with premium quality and measure 49 x 36cm when complete. Great puzzles for Children 6 years old and up.Bestselling puzzle brand worldwide - With over 1 billion puzzles sold, our children’s jigsaw puzzles make ideal gifts for boys and great gifts for girls. Perfect toys for your child – Puzzles for toddlers and kids of every age help support a child’s development as they play, building skills such as concentration and creativity. Positively Puzzling - From fun family times together to long term health benefits and day-to-day mindful moments, there are so many positives about the humble Jigsaw! They make a great birthday gift or smashing Christmas gift", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Childrens-Jigsaw-Puzzle-Beautiful-Ocean-100-Pieces-Puzzle-10681.webp", "https://ravensburger.cloud/images/produktseiten/520x445/10681_1.webp"], "price": [["16.99", "USD"]], "article_num": "10681", "ean": "4005556106813", "barcode": "4005556106813", "brand": "Ravensburger", "tags": ["animals", "underwater world", "puzzles for kids"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-kids/beautiful-ocean-10681", "age": "6 - 99"}