{"puzzle_name": "Canada Jigsaw Nationals: Ocean Treasures", "num_pieces": 500, "box_dimensions": "11.6\" x 9.1\" x 1.5\"", "puzzle_dimensions": "19.5 x 14.25 inches (49 x 36 cm)", "description": "Reveal the real riches of the sea as you piece together our “Ocean Treasures” jigsaw puzzle and let all your cares float away! Discover the spectacular natural beauty beneath the waves in our vibrant “Ocean Treasures” 500-piece puzzle! Momma sea turtle is keeping a watchful eye on her hatchlings, while an orca surfs the waves. Some tropical fish swimming among colorful coral, algae and seagrass completes the scene. This luminous illustration was completed in the speed-puzzling Pairs Qualifier Round at the 2025 Canadian National Jigsaw Puzzle Competition! This 500-piece jigsaw puzzle combines captivating imagery with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Our puzzles are crafted with an exclusive, extra-thick cardboard backing and a superior, linen-structured paper so the printed image is vibrant and glare-free. Create memorable moments with Ravensburger premium puzzles! About the Artist: Sheena Pike is a self-taught Canadian artist who enjoys combining realistic and illustrative styles to create her imaginative and whimsical designs. Fascinated by color since a young child, she takes full advantage of the glorious palette our spectrum offers. Her work, including cross stitch and diamond painting, may be found worldwide. Fun for ages 12 and up! Measures approximately 19.5 x 14.25 inches (49 x 36 cm) when completed. Made in Germany.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Canada-Jigsaw-Nationals-Ocean-Treasures-500-Pieces-Puzzle-12001638.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001638_1.webp"], "price": [["17.99", "USD"]], "article_num": "12001638", "ean": "4005555016380", "barcode": "4005555016380", "brand": "Ravensburger", "tags": ["ocean", "sea turtle", "jigsaw puzzle", "Canada", "puzzles for adults"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/canada-jigsaw-nationals-ocean-treasures-12001638", "age": "12+"}