{"puzzle_name": "Celestial Constellations", "num_pieces": 1000, "box_dimensions": "13.2\" x 10\" x 2.2\"", "puzzle_dimensions": "0.1\" x 27.6\" x 19.7\"", "description": "Thank your lucky stars and enjoy hours of relaxing fun piecing together our “Celestial Constellations” jigsaw puzzle by artist Elspeth McLean! Artist Elspeth McLean has once again worked her magic, combining 12 meticulously painted stones crowned by a star-sign constellation with the sun, moon and shooting stars. From Aquarius to Sagittarius, Libra to Leo, each stone is set on top of a hand-painted background done in her incredible intricate dot technique. The result is an out-of-this-world work of art! This heavenly scene was completed in the Teams Finals at the 2024 USA Jigsaw Nationals speed-puzzling competition! This 1,000-piece jigsaw puzzle combines captivating imagery with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Our puzzles are crafted with an exclusive, extra-thick backing along with our superior, linen-structured paper, so the printed image is vibrant, crisp, and glare-free. Create memorable moments with Ravensburger premium puzzles! About the Artist: Elspeth McLean shares, “Painting is my happy place, and color is the language of my soul. By using my intricate dot technique, I create artwork that is both an expression of my life and the world around me in a joyous, uplifting way. In a world where so much darkness exists, I choose to be a light of positivity.” Fun for ages 14 and up! Measures approximately 27 x 19.5 inches (70 x 50 cm) when completed.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Celestial-Constellations-1000-Pieces-Puzzle-12001194.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001194_1.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001194_2.webp"], "price": [["24.99", "USD"]], "article_num": "12001194", "ean": "4005555011941", "barcode": "4005555011941", "brand": "Ravensburger", "tags": ["design", "art", "creativity", "mandala", "universe"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/celestial-constellations-12001194", "age": "14+"}