{"puzzle_name": "Children’s Jigsaw Puzzle Alphabet - 30 Pieces Puzzle", "num_pieces": 30, "box_dimensions": "10.8\" x 7.6\" x 2.2\"", "puzzle_dimensions": "0.1\" x 14.2\" x 10.2\"", "description": "There's so much to enjoy on this bright and colourful alphabet puzzle! Each piece shows an animal, person or item most children will recognise, and the simple layout makes it easier to associate the objects with their starting letter or word. Letters and words are in a style that children will recognize when they start nursery or school, and each object is phonetically correct, helping children to \"hear\" each individual starting letter/sound. Puzzle can also be used as a simple \"look and find\" game. Comes with leaflet giving ideas for play. Supports Early Years Foundation Syllabus guidelines and helps to build your child's confidence and knowledge. Our 30 piece kids puzzles are crafted with premium quality and measure 36 x 26cm when complete. Great puzzles for Children 3 years old and up.Bestselling puzzle brand worldwide - With over 1 billion puzzles sold, our children’s jigsaw puzzles make ideal gifts for boys and great gifts for girls. Perfect toys for your child – Puzzles for kids of every age help support a child’s development as they play, building skills such as concentration and creativity. Positively Puzzling - From fun family times together to long term health benefits and day-to-day mindful moments, there are so many positives about the humble Jigsaw! They make a great birthday gift or smashing Christmas gift.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Childrens-Jigsaw-Puzzle-Alphabet-30-Pieces-Puzzle-05228.webp", "https://ravensburger.cloud/images/produktseiten/520x445/05228_1.webp"], "price": [["12.99", "USD"]], "article_num": "05228", "ean": "4005556052288", "barcode": "4005556052288", "brand": "Ravensburger", "tags": ["alphabet", "children", "puzzle", "educational"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-kids/alphabet-05228", "age": "3 - 99"}