{"puzzle_name": "Country Life", "num_pieces": 300, "box_dimensions": "12.1\" x 10\" x 2.7\"", "puzzle_dimensions": "0.1\" x 27.6\" x 19.7\"", "description": "Welcome home to the “Country Life” where simple pleasures are thoughtfully captured by artist Steve Read in our 300-piece Large Format puzzle! End your day with as much joy as this dog greeting their person when you piece together our “Country Life” jigsaw puzzle! The pigs in the pen are excited to see you, but mama duck is too busy getting her ducklings to the water to pay attention. The warm glow of lights in the house invites you inside. Can you smell what’s cooking in the oven for dinner? Take a break at the end of your busy day and enjoy hours of relaxing, mindful moments out in the country! This 300-piece Large Format jigsaw puzzle combines captivating imagery with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Made from 70% or more recycled materials, our puzzles are crafted with an exclusive, extra-thick cardboard backing topped by our superior, linen-structured paper, so the printed image is vibrant, crisp, and glare-free. Create memorable moments with Ravensburger premium puzzles! About the Artist: The originator of our “Cozy Retreat” puzzle, Steve Read is a talented, self-taught artist. First a mural designer, he became a freelance illustrator, working on high-profile ad campaigns and licensing for 20 years. Steve’s broad portfolio of amazing work ranges from beautiful fantasy illustrations to landscapes and gothic art. Steve lives in the UK and his captivating images can be found on products worldwide. Fun for ages 9 and up! Measures approximately 27 x 19.5 inches (70 x 50 cm) when completed. Made in Germany.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Country-Life-300-Pieces-Puzzle-12001481.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001481_1.webp"], "price": [["21.99", "USD"]], "article_num": "12001481", "ean": "4005555014812", "barcode": "4005555014812", "brand": "Ravensburger", "tags": ["country", "life", "puzzle", "animals", "art"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/country-life-12001481", "age": "9+"}