{"puzzle_name": "Canada Jigsaw Nationals: Halifax Harbour", "num_pieces": 1000, "box_dimensions": "13.2\" x 10\" x 2.2\"", "puzzle_dimensions": "0.1\" x 27.6\" x 19.7\"", "description": "Escape to Nova Scotia as you piece together a collage of colorful cottages and seaside businesses in our “Halifax Harbour” jigsaw puzzle! Come to “Halifax Harbour” and enjoy a refreshing ice cream at Beavertails! Artist Alice Hinther has plucked some of her favorite buildings and relocated them to create this vibrant scene. From the Town Clock on Citadel Hill, to Alexander Keith’s Brewery, to a stretch of one of the world’s longest continuous boardwalks, you’re sure to enjoy a visit to historic Halifax. This charming scene was completed in the Teams Qualifier Round at the 2025 Canadian Jigsaw Nationals speed-puzzling competition!This 1,000-piece jigsaw puzzle combines captivating imagery with our exclusive, extra-thick cardboard backing, clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Create memorable moments with Ravensburger premium puzzles! About the Artist: A former painter of house portraits, Alice Hinther masterfully creates folk art style paintings of small towns creating a pleasing, cohesive collage. Best known for her popular line of witty, and sometimes sassy, greeting cards, this self-taught, multi-media artist also creates calendars, stained glass mosaics, garden art, jewelry, and used her collection of miniatures to create the book, “The Adventures of Mr. Mouse.” Alice lives in Kingston, Ontario, Canada. You can see Alice's work on her website at: alicehintherdesignFun for ages 14 and up! Measures approximately 27 x 20 inches (70 x 50 cm) when completed. Made in Germany.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Canada-Jigsaw-Nationals-Halifax-Harbour-1000-Pieces-Puzzle-12001641.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001641_1.webp"], "price": [["24.99", "USD"]], "article_num": "12001641", "ean": "4005555016410", "barcode": "4005555016410", "brand": "Ravensburger", "tags": ["Halifax", "Nova Scotia", "jigsaw puzzle", "Canada", "puzzles for adults"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/canada-jigsaw-nationals-halifax-harbour-12001641", "age": "14+"}