{"puzzle_name": "Cozy Backyard Bliss", "num_pieces": 750, "box_dimensions": "12.1\" x 10\" x 2.7\"", "puzzle_dimensions": "0.1\" x 31.5\" x 23.6\"", "description": "Kick off your shoes and enjoy the fruits of your labors in our “Cozy Backyard Bliss” puzzle! The garden chores are done, so set aside your gloves and trowel and relax with a cool, refreshing glass of lemonade! This welcoming outdoor sanctuary is a tribute to your green thumb, with climbing roses providing extra shade beneath the pergola. A hanging basket brims with lightly fragrant fuchsia, while Nikko Blue hydrangeas cool off the hot pink shades. The soothing waterfall has lulled Lulu into a contented cat nap. Now, do you pick out those new shoes, or plan your next vacation?This 750-piece Large Format jigsaw puzzle combines easy-to-handle, clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience. With pieces 30% larger than standard, details are easy to see, so you can complete it in just a day or two. Create memorable moments with Ravensburger premium puzzles! About the Artist: The talented artist of our original “Cozy Retreat” puzzle, Steve Read is self-taught. Starting work as a mural designer, he became a freelance illustrator, working on high profile advertising campaigns and licensing for 20 years. Steve has developed a very broad portfolio of amazing work, ranging from beautiful fairytale and fantasy images to landscapes and gothic art. His captivating images can be found on a wide range of products worldwide.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Cozy-Backyard-Bliss-750-Pieces-Puzzle-16941.webp", "https://ravensburger.cloud/images/produktseiten/520x445/16941_1.webp"], "price": [["28.99", "USD"]], "article_num": "16941", "ean": "4005556169412", "barcode": "4005556169412", "brand": "Ravensburger", "tags": ["garden", "relaxation", "puzzle", "outdoor", "art", "Steve Read"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/cozy-backyard-bliss-16941", "age": "12 - 99"}