{"puzzle_name": "Butterfly Place", "num_pieces": 500, "box_dimensions": "12.1\" x 10\" x 2.7\"", "puzzle_dimensions": "27.6\" x 19.7\"", "description": "Let your cares of the day flutter away as you spend time puzzling “The Butterfly Place” by artist Ingrid Slyder! Visit “The Butterfly Place” and while away the hours with our delightful 500-piece Large Format jigsaw puzzle! There’s a swallowtail, a blue morpho, and a bright yellow cloudless sulphur, among others. Is that a painted lady or a monarch? These beauties are busy alighting on colorful blooms including purple buddleia, also known as butterfly bush. This lovely scene makes a delightful gift for your favorite gardener, and was used in the 2025 Jigsaw Nationals in a 1000-piece format!This 500-piece Large Format jigsaw puzzle combines captivating imagery with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Our puzzles are crafted with an exclusive, extra-thick cardboard backing topped by our superior, linen-structured paper, so the printed image is vibrant and glare-free. Create memorable moments with Ravensburger premium puzzles! About the Artist: Ingrid Slyder is a watercolorist living in Richmond, Virginia. She studied Biology at James Madison University where she also acquired a minor in Fine Arts (as well as her husband Duane!). When she's not painting, she enjoys gardening and is particularly delighted when her yard attracts chipmunks, hummingbirds and her two adult children. Fun for ages 12 and up! Measures approximately 27 x 19.5 inches (70 x 50 cm) when completed. Made in Germany.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Butterfly-Place-500-Pieces-Puzzle-12001356.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001356_1.webp"], "price": [["24.99", "USD"]], "article_num": "12001356", "ean": "4005555013563", "barcode": "4005555013563", "brand": "Ravensburger", "tags": ["butterflies", "gardening", "nature", "art", "puzzles"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/butterfly-place-12001356", "age": "12+"}