{"puzzle_name": "Beautiful Bavaria", "num_pieces": null, "box_dimensions": "17.1\" x 13.2\" x 1.6\"", "puzzle_dimensions": "0.1\" x 15.8\" x 11.8\"", "description": "Picture yourself on a path of tranquility as you paint this breathtaking scene of “Beautiful Bavaria” with this CreArt Painting by Numbers set! Painting “Beautiful Bavaria” is as easy as 1, 2, 3 with this CreArt paint-by-number kit, perfect for first-time and seasoned artists alike! Relax your mind and go to your peaceful place with no screens and no demands as you fill in each clearly numbered section, bit by bit. High-quality, odorless acrylic paints ensure excellent results. When finished, hang and admire this stunning scene, or give as a thoughtful gift! De-stress and find success as you discover the joy of art in your heart today! Enjoy the relaxing and rewarding experience of creating art without the pressure of facing a blank canvas! Just as great cooks follow recipes to make delicious dishes, the prepared patterns in this Painting by Numbers set lets you create a personal masterpiece you’ll be proud to display. A meditative activity, painting can help relieve the stress of the day while providing a satisfying sense of accomplishment! With the same dependable quality you’ve come to know in our puzzles and games, this premium paint-by-number kit comes with everything you need: a durable, smooth white painting board with clearly numbered sections; 31 easy-open/close water-based, odorless acrylic paints in matching numbered pots; finishing gloss; dual-tipped, wood-handle paintbrush with fine points (#1, #2) for precise details; artist pallet to keep paint pots steady; and easy-to-follow guide sheet.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Ravensburger-Beautiful-Bavaria-20274.webp", "https://ravensburger.cloud/images/produktseiten/520x445/20274_1.webp"], "price": [["22.74", "USD"], ["34.99", "USD"]], "article_num": "20274", "ean": "4005556202744", "barcode": "4005556202744", "brand": "Ravensburger", "tags": ["paint by number", "art", "crafts", "Bavaria"], "product_url": "https://www.ravensburger.us/en-US/products/art-crafts/paint-by-number-for-adults/beautiful-bavaria-20274", "age": "12+"}