{"puzzle_name": "Animals, Aliens and Ninjas", "num_pieces": 1000, "box_dimensions": "13.2\" x 10\" x 2.2\"", "puzzle_dimensions": "0.1\" x 27.6\" x 19.7\"", "description": "Join the mission of freeing all the “Animals, Aliens and Ninjas” in this wild and wacky puzzle full of fun shenanigans! It’s the middle of the night but there’s mischief afoot in these grocery store vending machines. Our “Animals, Aliens and Ninjas” jigsaw puzzle captures some courageous ninjas on a mission to set their fellow prize-toy prisoners free! Armed with stacks of tokens, and with the help of a cooperative snake, they’ll have everyone out in no time. Enjoy a nod to nostalgia as you enjoy the stress-reducing, mindful experience puzzles provide, as well as a satisfying sense of accomplishment. Beam me up! This 1,000-piece jigsaw puzzle combines captivating imagery with clean-cut pieces and Ravensburger’s perfect interlocking fit for a most pleasurable puzzling experience! Made from 70% or more recycled materials, our puzzles are crafted with an exclusive, extra-thick backing along with our superior, linen-structured paper, so the printed image is vibrant, crisp, and glare-free. Create memorable moments with Ravensburger premium puzzles! About the Artist: Based in the U.K., WigWam Studios’ dedicated team of creative-thinking, design-tinkering, superstar illustrators guide their creative process with amazing results! Everything they do starts with a pencil, designing artwork rich in storytelling and full of delightful surprises. Fun and fun-loving, WigWam is synonymous with world-class quality, creating exceptional illustrations that are simply a pleasure to puzzle! Fun for ages 14 and up! Measures approximately 27 x 19.5 inches (70 x 50 cm) when completed. Made in Germany.", "image_urls": ["https://ravensburger.cloud/images/product-cover/520x445/Jigsaw-Puzzle-Animals-Aliens-and-Ninjas-1000-Pieces-Puzzle-12001482.webp", "https://ravensburger.cloud/images/produktseiten/520x445/12001482_1.webp"], "price": [["24.99", "USD"]], "article_num": "12001482", "ean": "4005555014829", "barcode": "4005555014829", "brand": "Ravensburger", "tags": ["fantasy", "adventure", "animals", "imagination"], "product_url": "https://www.ravensburger.us/en-US/products/jigsaw-puzzles/puzzles-for-adults/animals-aliens-and-ninjas-12001482", "age": "14+"}